Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтнесениеАктовНаПринятыеЧасыРаботы.Ссылка КАК Ссылка,
	|	ОтнесениеАктовНаПринятыеЧасыРаботы.Дата КАК Дата,
	|	ОтнесениеАктовНаПринятыеЧасыРаботы.Сотрудник КАК Сотрудник,
	|	ОтнесениеАктовНаПринятыеЧасыРаботы.ЭтапПроекта КАК ЭтапПроекта,
	|	ОтнесениеАктовНаПринятыеЧасыРаботы.Часы КАК Часы,
	|	ОтнесениеАктовНаПринятыеЧасыРаботы.Сумма КАК Сумма,
	|	ОтнесениеАктовНаПринятыеЧасыРаботы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОтнесениеАктовНаПринятыеЧасыРаботы.КомментарийДляБудущегоАкта КАК КомментарийДляБудущегоАкта,
	|	ОтнесениеАктовНаПринятыеЧасыРаботы.Акт КАК Акт,
	|	ОтнесениеАктовНаПринятыеЧасыРаботы.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ втДокумент
	|ИЗ
	|	Документ.ОтнесениеАктовНаПринятыеЧасы.Работы КАК ОтнесениеАктовНаПринятыеЧасыРаботы
	|ГДЕ
	|	ОтнесениеАктовНаПринятыеЧасыРаботы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ПринятыеЧасыВСчетБудущихАктов"" КАК ИмяРегистра_,
	|	втДокумент.Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДВиженияНакопления.Расход) КАК ВидДвижения,
	|	втДокумент.Ссылка.Проект КАК Проект,
	|	втДокумент.ЭтапПроекта КАК ЭтапПроекта,
	|	втДокумент.Дата КАК Дата,
	|	втДокумент.Сотрудник КАК Сотрудник,
	|	&ДатаСреза КАК Период,
	|	втДокумент.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втДокумент.Часы КАК Часы,
	|	втДокумент.Сумма КАК Сумма,
	|	втДокумент.Подразделение КАК Подразделение,
	|	втДокумент.КомментарийДляБудущегоАкта КАК КомментарийДляБудущегоАкта
	|ИЗ
	|	втДокумент КАК втДокумент
	|ГДЕ
	|	втДокумент.Акт <> ЗНАЧЕНИЕ(Документ.АктВыполненныхРабот.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""АктыПринятыхЧасов"" КАК ИмяРегистра_,
	|	втДокумент.Ссылка КАК Регистратор,
	|	втДокумент.Ссылка.Проект КАК Проект,
	|	втДокумент.ЭтапПроекта КАК ЭтапПроекта,
	|	втДокумент.Дата КАК Дата,
	|	втДокумент.Сотрудник КАК Сотрудник,
	|	&ДатаСреза КАК Период,
	|	втДокумент.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	втДокумент.Часы КАК Часы,
	|	втДокумент.Сумма КАК Сумма,
	|	втДокумент.Подразделение КАК Подразделение,
	|	втДокумент.Акт КАК Акт
	|ИЗ
	|	втДокумент КАК втДокумент
	|ГДЕ
	|	втДокумент.Акт <> ЗНАЧЕНИЕ(Документ.АктВыполненныхРабот.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Ссылка"   , ДокументСсылка);
	Запрос.УстановитьПараметр("ДатаСреза", ДокументСсылка.Дата);
		
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаАктыПринятыхЧасов"				, Результат[Результат.Количество() - 1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаПринятыеЧасыВСчетБудущихАктов"	, Результат[Результат.Количество() - 2].Выгрузить());
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ОтнесениеАктовНаПринятыеЧасы.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ОтнесениеАктовНаПринятыеЧасы.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ОтнесениеАктовНаПринятыеЧасы.СоздатьДокумент();
	КонецЕсли;
КонецПроцедуры

