Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ПланПроектаПоказатели.Период КАК ПериодПланирования,
	 |	&Проект КАК Проект,
	 |	&Сценарий КАК Сценарий,
	 |	ПланПроектаПоказатели.ЭтапПроекта КАК ЭтапПроекта,
	 |	ПланПроектаПоказатели.Статья КАК Статья,
	 |	ПланПроектаПоказатели.Подразделение КАК Подразделение,
	 |	ПланПроектаПоказатели.Сотрудник КАК Сотрудник,
	 |	ПланПроектаПоказатели.КонтрагентАбонент КАК КонтрагентАбонент,
	 |	ПланПроектаПоказатели.Время КАК Время,
	 |	ПланПроектаПоказатели.Сумма КАК Сумма,
	 |	&Период КАК Период,
	 |	""ПланированиеПроектов_План"" КАК ИмяРегистра_
	 //Лобашова 29.05.2019  87156 +
	 |	,
	 |	ПланПроектаПоказатели.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
	 |	ПланПроектаПоказатели.Квалификация КАК Квалификация
	 //Лобашова 29.05.2019  87156 -
	 |ИЗ
	 |	Документ.ПланПроекта.Показатели КАК ПланПроектаПоказатели
	 |ГДЕ
	 |	ПланПроектаПоказатели.Ссылка = &Ссылка";
	 Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	 Запрос.УстановитьПараметр("Период",ДокументСсылка.Дата);
	 Запрос.УстановитьПараметр("Проект",ДокументСсылка.Проект);
	 Запрос.УстановитьПараметр("Сценарий",ДокументСсылка.Сценарий);
	 
	 ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
     ТаблицыДляДвижений.Вставить("ТаблицаПланированиеПроектов_План"			, Запрос.Выполнить().Выгрузить());
КонецПроцедуры	
 
Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПланПроекта.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПланПроекта.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПланПроекта.СоздатьДокумент();
	КонецЕсли;
КонецПроцедуры
