
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
  	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		Объект.ЭтапПроекта = УРВСервер.НайтиОсновнойЭтапДляПодстановкиВДокументы(Объект.Проект);
	Иначе
		Объект.ЭтапПроекта = ПредопределенноеЗначение("Справочник.ЭтапыПроектов.ПустаяСсылка");
		
	КонецЕсли;	
КонецПроцедуры

