
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СтрукутраВозврата = Новый Структура("ВыбиратьИзСписка, МассивДанных",Ложь,Новый Массив);
	ОбновитьДанныеНаСервере(ПараметрКоманды, СтрукутраВозврата);
	
	Если СтрукутраВозврата.ВыбиратьИзСписка Тогда
		ОткрытьФорму("Справочник.Абоненты.Форма.ФормаВыбораКонтрагентаИзСписка",Новый Структура("МассивДанных, Источник",СтрукутраВозврата.МассивДанных, ПолучитьСсылку(ПараметрКоманды)),ПараметрыВыполненияКоманды.Источник,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ОбновитьДанныеНаСервере(Источник, СтрукутраВозврата)
	ОбъектАб = Источник.ПолучитьОбъект();
	ОбработкаОбъект = Обработки.СозданиеОбъектовURMExchange.Создать();
	таблицаXDTO = ОбработкаОбъект.ЗагрузкаДанныхИзURM("GetPartner",Строка(Источник.GUIDОБД),Строка(Источник.ИНН));
	Если таблицаXDTO = Неопределено ИЛИ таблицаXDTO.Количество() = 0 Тогда
		Сообщить("Данные по контрагенту не найдены.");
		Возврат
	КонецЕсли;
	Если таблицаXDTO.Количество() > 1 Тогда
		СтрукутраВозврата.ВыбиратьИзСписка = Истина;
		Для Каждого строкаXDTO Из таблицаXDTO Цикл
			СтруктураДанных = Новый Структура("GUIDPartner, INN, Name");
			ЗаполнитьЗначенияСвойств(СтруктураДанных,строкаXDTO);
			СтрукутраВозврата.МассивДанных.Добавить(СтруктураДанных);
		КонецЦикла;	
		Возврат
	КонецЕсли;	
	строкаXDTO = таблицаXDTO[0];
	ИзмененияДоступны = Ложь;
	Если строкаXDTO.Name <> Источник.Наименование Тогда
		ОбъектАб.Наименование = строкаXDTO.Name;
		ИзмененияДоступны = Истина;
	КонецЕсли;
	Если строкаXDTO.GUIDPartner <> СокрЛП(Источник.GUIDОБД) Тогда
		ОбъектАб.GUIDОБД = Новый УникальныйИдентификатор(строкаXDTO.GUIDPartner);
		ИзмененияДоступны = Истина;
	КонецЕсли;
	Если строкаXDTO.INN <> Источник.ИНН Тогда
		ОбъектАб.INN = строкаXDTO.ИНН;
		ИзмененияДоступны = Истина;
	КонецЕсли;
	Если ИзмененияДоступны Тогда
		Модифицированность = Истина;
	Иначе
		Сообщить("Данные не изменились.");
	КонецЕсли;
	
	Если ИзмененияДоступны Тогда
		Попытка
			ОбъектАб.Записать();
		Исключение
			Сообщить("Не удалось обновить данные по причине: " + ОписаниеОшибки());
		КонецПопытки;	
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ПолучитьСсылку(ПараметрКоманды)
	Возврат ПараметрКоманды.Ссылка
КонецФункции	