
#Область ПрограммныйИнтерфейс

// Устанавливает факт обработки уведомления
Процедура ДобавитьОбработанноеУведомление(ВидСобытия, ОбъектУведомления, Получатель) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.ОбработанныеУведомления.СоздатьМенеджерЗаписи();
	Запись.ВидСобытия = ВидСобытия;
	Запись.ОбъектУведомления = ОбъектУведомления;
	Запись.Получатель = Получатель;
	Запись.Прочитать();
	
	Запись.ВидСобытия = ВидСобытия;
	Запись.ОбъектУведомления = ОбъектУведомления;
	Запись.Получатель = Получатель;
	Запись.ДатаОбработки = ТекущаяДата();
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

