

//==================================================================================================
#Область СобытияФормы
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ИтоговыйСтатус, Работа");
		Элементы.Образец.ЦветТекста	= Параметры.ЦветТекста; 
		Элементы.Образец.ЦветФона	= Параметры.ЦветФона;
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти


//==================================================================================================
#Область СобытияЭлементовФормы
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура УстановитьЦветТекста(Команда)
	
	ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
	ДиалогВыбораЦвета.Цвет = Элементы.Образец.ЦветТекста;
	ДиалогВыбораЦвета.Показать(Новый ОписаниеОповещения("УстановитьЦветТекста_Завершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦветТекста_Завершение(ВыбранныйЦвет, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ВыбранныйЦвет) = Тип("Цвет") Тогда
		Элементы.Образец.ЦветТекста = ВыбранныйЦвет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦветФона(Команда)
	
	ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
	ДиалогВыбораЦвета.Цвет = Элементы.Образец.ЦветФона;
	ДиалогВыбораЦвета.Показать(Новый ОписаниеОповещения("УстановитьЦветФона_Завершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦветФона_Завершение(ВыбранныйЦвет, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ВыбранныйЦвет) = Тип("Цвет") Тогда
		Элементы.Образец.ЦветФона = ВыбранныйЦвет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформление(Команда)
	
	Закрыть(Новый Структура("ЦветТекста, ЦветФона", Элементы.Образец.ЦветТекста, Элементы.Образец.ЦветФона));
	
КонецПроцедуры

#КонецОбласти



//==================================================================================================
#Область СобытияОбщегоНазначения
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


#КонецОбласти


//==================================================================================================


