
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Проект") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Проект",Параметры.Проект,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ИначеЕсли  РольДоступна("РуководительПроектов") и не РольДоступна("ПолныеПрава") тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Проект", ОбщегоНазначения.ПолучитьСписокДоступныхПроектов(), ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
КонецПроцедуры
