
#Область ПрограммныйИнтерфейс
    
// Выполняет добавление работы в фактические трудозатраты
//
Процедура ДобавитьВОтчетКлиент(ДатаРаботы, Источник) Экспорт
	
	НуженДиалог = Ложь;
	ПараметрыОповещения = Неопределено;
	
	Длительность = 0;
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("ДатаРаботы", ДатаРаботы);
	ПараметрыФормы.Вставить("ОписаниеРаботы", Строка(Источник));
	ПараметрыФормы.Вставить("Длительность", Длительность);
	ПараметрыФормы.Вставить("Источник", Источник);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗавершениеФормыДобавленияРаботы", ЭтотОбъект);
			
	ОткрытьФорму("РегистрСведений.ФактическиеТрудозатраты.Форма.ФормаДобавленияРаботы", ПараметрыФормы,,,,, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ЗавершениеФормыДобавленияРаботы(ПараметрыОтчета, Параметры) Экспорт
	
	ПараметрыОповещения = Неопределено;
	
	Если ПараметрыОтчета <> Неопределено Тогда
		УчетВремениВызовСервера.ДобавитьВОтчет(ПараметрыОтчета, ПараметрыОповещения);
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ФактическиеТрудозатраты"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 
