///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДанныеАутентификации = Новый Структура;
	ДанныеАутентификации.Вставить("Логин",  Логин);
	ДанныеАутентификации.Вставить("Пароль", Пароль);
	
	ТекущийОбъект.ДанныеАутентификацииСПартнерскимAPI_1C = Новый ХранилищеЗначения(ДанныеАутентификации);
	
КонецПроцедуры

#КонецОбласти
