#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет движения по показателям пожеланий.
//
// Параметры:
//  Движения   - ДокументОбъект.Обращение.Движения.ЗначенияПоказателей - движения документа.
//  Объект     - СправочникСсылка.Консультации, СправочникСсылка.Ошибки, СправочникСсылка.Пожелание - объект базы знаний.
//  Показатель - ПеречислениеСсылка.ПоказателиПожеланий - показатель
//  Значение   - Число - значение показателя
//
Процедура ДобавитьДвижение(Движения, Период, Объект, Показатель, Значение) Экспорт
        
    УстановитьПривилегированныйРежим(Истина);
    
    Движения.Записывать = Истина;
    
    Движение = Движения.Добавить();
    Движение.Период = Период;
    Движение.Объект = Объект;
    Движение.Показатель = Показатель;
    Движение.Значение = Значение;
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
