
#Область ОбработчикиСобытийФормы
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьУправлениеСеансами(Команда)
    
    ПараметрыФормы = Новый Структура("ИннКлиента",ИНН);
    ОткрытьФорму("ОбщаяФорма.УправлениеСеансами1С_Онлайн", ПараметрыФормы); 
    
КонецПроцедуры
    	
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьИННКлиентаНаСервере(Контрагент)

	Возврат Контрагент.ИНН;
    
КонецФункции // ()

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
    ИНН = ПолучитьИННКлиентаНаСервере(Контрагент);
КонецПроцедуры


#КонецОбласти





