#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьНовость(Заголовок, Объект = Неопределено, Приоритет = 3, СрокАктуальности = 7) Экспорт
    
    Новость = Справочники.Новости.СоздатьЭлемент();
    Новость.Наименование = Заголовок;
    Новость.ДатаСоздания = ТекущаяУниверсальнаяДата();
    Новость.ДатаАктуальности = СрокАктуальности * 24 * 60 * 60;
    Новость.Объект = Объект;
    Для каждого Строка Из Объект.Сервисы Цикл
    	НоваяСтрока = Новость.Сервисы.Добавить();
        НоваяСтрока.Сервис = Строка.Сервис;
    КонецЦикла; 
    Для каждого Строка Из Объект.Компоненты Цикл
    	НоваяСтрока = Новость.Компоненты.Добавить();
        НоваяСтрока.Компонент = Строка.Компонент;
    КонецЦикла; 
    Новость.Приоритет = Приоритет;
    Новость.Публиковать = Истина;
    
    Новость.Записать();
	
КонецПроцедуры

#КонецОбласти     

#КонецЕсли
