#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сервис по умолчанию, если в справочнике Сервисы присутствует только 1 элемент.
//
// Параметры:
//  Сервис - СправочникСсылка.Сервисы - исходное значение сервиса.
// 
// Возвращаемое значение:
//  СправочникСсылка.Сервисы - сервис по умолчанию.
//
Функция СервисПоУмолчанию(Сервис = Неопределено, ВнутреннийСервис = Ложь) Экспорт //Рарус kruser 24.04.2019 Параметр ВнутреннийСервис
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
        |	Сервисы.Ссылка КАК Сервис
        |ИЗ
        |	Справочник.Сервисы КАК Сервисы
        |ГДЕ
        |	НЕ Сервисы.ПометкаУдаления
		//{Рарус kruser 24.04.2019
		|	И Сервисы.Внутренний = &Внутренний
		|	И ОсновнойСервис"; 
		//}Рарус kruser 24.04.2019		
		
	//{Рарус kruser 24.04.2019
	Запрос.УстановитьПараметр("Внутренний", ВнутреннийСервис);
	//}Рарус kruser 24.04.2019
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Если Выборка.Количество() = 1 И Выборка.Следующий() Тогда
        Возврат Выборка.Сервис;
    Иначе
        Возврат ?(Не ЗначениеЗаполнено(Сервис), Справочники.Сервисы.ПустаяСсылка(), Сервис);
    КонецЕсли; 
    
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПервыеЛинииСервисов() Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    	"ВЫБРАТЬ
        |	Сервисы.Ссылка
        |ИЗ
        |	Справочник.Сервисы КАК Сервисы
        |ГДЕ
        |	Сервисы.ПерваяЛиния = ЗНАЧЕНИЕ(Справочник.ЛинииПоддержки.ПустаяСсылка)";
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    ПерваяЛиния = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.ОбслуживающиеОрганизации.СлужбаПоддержки, "ПерваяЛинияПоддержки");
    
    Пока Выборка.Следующий() Цикл
        СервисОбъект = Выборка.Ссылка.ПолучитьОбъект();
        СервисОбъект.ПерваяЛиния = ПерваяЛиния;
        СервисОбъект.Записать();
    КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти 

#КонецЕсли
