#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
    КонецЕсли;
    
    ИсходныйПрефикс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Префикс");
	ДополнительныеСвойства.Вставить("ИсходныйПрефикс", ИсходныйПрефикс);
    
    ПроверитьЗаполнение();
    
    Если ЭтоНовый() Тогда
        Если Не ЗначениеЗаполнено(Ссылка) Тогда
            УстановитьСсылкуНового(Справочники.Сервисы.ПолучитьСсылку(Новый УникальныйИдентификатор));
        КонецЕсли;
        ОсновнаяВитринаОбъект = Справочники.Витрины.СоздатьЭлемент();
        ОсновнаяВитринаОбъект.Владелец = ПолучитьСсылкуНового();
        ОсновнаяВитринаОбъект.Наименование = Наименование;
        ОсновнаяВитринаОбъект.УчетнаяЗапись = УчетнаяЗаписьСлужбыПоддержкиПоУмолчанию;
        ОсновнаяВитринаОбъект.Записать();
        ОсновнаяВитрина = ОсновнаяВитринаОбъект.Ссылка;
    ИначеЕсли ЗначениеЗаполнено(ОсновнаяВитрина) И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВитринСервисов") Тогда
        // Если исползуется только одна витрина, поддержим актуальность ее полей в соответствие с полями сервиса.
        ОсновнаяВитринаОбъект = ОсновнаяВитрина.ПолучитьОбъект();
        ОсновнаяВитринаОбъект.Наименование = Наименование;
        ОсновнаяВитринаОбъект.УчетнаяЗапись = УчетнаяЗаписьСлужбыПоддержкиПоУмолчанию;
        ОсновнаяВитринаОбъект.Записать();
    КонецЕсли;
	
	//{Рарус kruser 26.04.2019 84132
	ПроверитьОсновнойСервис(Отказ);
	//}Рарус kruser 26.04.2019 84132

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
    
    Если ДополнительныеСвойства.Свойство("Префикс") И ДополнительныеСвойства.ИсходныйПрефикс <> Префикс Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли; 
	
КонецПроцедуры

//{Рарус kruser 26.04.2019 84132
&НаСервере
Процедура ПроверитьОсновнойСервис(Отказ)
	
	Если ОсновнойСервис Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сервисы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сервисы КАК Сервисы
		|ГДЕ
		|	НЕ Сервисы.ПометкаУдаления
		|	И Сервисы.Внутренний = &Внутренний
		|	И Сервисы.ОсновнойСервис
		|	И НЕ Сервисы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Внутренний", Внутренний);
		Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Пустой();
		
		Если Не РезультатЗапроса Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сервис по умолчанию уже указан");
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//}Рарус kruser 26.04.2019 84132

#КонецОбласти

#КонецЕсли
