
#Область ПрограммныйИнтерфейс
    
// Заполняет наименование процесса по предметам
// Параметры:
//  Объект - объект процесса.
//  Наименование - начальное наименование процесса.
//
Процедура ЗаполнитьНаименованиеПроцесса(Объект, Наименование) Экспорт
	
	Объект.Наименование = ПолучитьНаименованиеСПредметом(Наименование, Объект.Предмет);
	
КонецПроцедуры

// Возвращает строку наименования с перечислением предметов через запятую
//
Функция ПолучитьНаименованиеСПредметом(ШаблонНаименования, Предмет) Экспорт
	
	Наименование = СокрЛП(ШаблонНаименования);
	ПредставлениеПредмета = ОбщегоНазначения.ПредметСтрокой(Предмет);
	Если ЗначениеЗаполнено(ПредставлениеПредмета) Тогда
		Наименование = Наименование + " """ + ПредставлениеПредмета + """";
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

#КонецОбласти 
