
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если URMExchangeСервер.ПолучитьКонстантуОбменСОБД()Тогда
		ИмяОперации = "GetPartnerA";
		Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ОткрытьФорму("Обработка.СозданиеОбъектовURMExchange.Форма.Форма",Новый Структура("ИмяОперации", ИмяОперации),,,,,,Режим);
	Иначе
		Сообщить("Загрузка из ОБД не включена");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлементЗавершение(Результат, ДополнительныеПараметры) Экспорт
	//ОбновитьОтображениеДанных();
	//ОповеститьОбИзменении();
КонецПроцедуры
