
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
    
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
    
    Для Каждого Строка Из Строки Цикл
        ОтклонениеОформление = Строка.Значение.Оформление.Получить("ОтклонениеОтУниверсальногоВремени");
        Если ЗначениеЗаполнено(ОтклонениеОформление) Тогда
            Отклонение = Строка.Значение.Данные.ОтклонениеОтУниверсальногоВремени;
    		Если Отклонение >= 0 Тогда
    			Текст = "UTC+"+Формат('00010101' + Отклонение,"ДФ=HH:mm; ДП=00:00");
            Иначе
                Отклонение = -Отклонение;
    			Текст = "UTC-"+Формат('00010101' + Отклонение,"ДФ=HH:mm; ДП=00:00");
    		КонецЕсли;
            ОтклонениеОформление.УстановитьЗначениеПараметра("Текст", Текст);
        КонецЕсли;
    КонецЦикла; 
    
КонецПроцедуры

#КонецОбласти 
