
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Абонент") Тогда
		Абонент = Параметры.Отбор.Абонент;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Абонент) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru='Подписки абонента'"); 
		Элементы.Абонент.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокПодписок" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

