
Функция GetData(Запрос)
	
	ИмяМетода = Запрос.ПараметрыURL["ИмяМетода"];
	Сообщить(ИмяМетода);
	
	Если ИмяМетода = "getpersdata" Тогда
		Возврат МобильноеПриложениеСервер.GetPersData(Запрос);
	ИначеЕсли ИмяМетода = "firstsync" Тогда
		Возврат МобильноеПриложениеСервер.FirstSync(Запрос);
	ИначеЕсли ИмяМетода = "createdoc" Тогда
		Возврат МобильноеПриложениеСервер.CreateDoc(Запрос);
	ИначеЕсли ИмяМетода = "firstsync" Тогда
		Возврат МобильноеПриложениеСервер.FirstSync(Запрос);	
	КонецЕсли;
	
	
КонецФункции
