
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    
    ДатаСоздания = ТекущаяУниверсальнаяДата();
    ДатаАктуальности = ДатаСоздания + 604800; // 7 суток
    Приоритет = 3;
    
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
    
    ТекстHTML = Новый ХранилищеЗначения(ОбъектКопирования.ТекстHTML.Получить(), Новый СжатиеДанных(9));
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
