#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
    
    Если Ссылка.Пустая() И Не ЗначениеЗаполнено(ПолучитьСсылкуНового()) Тогда
		СсылкаНового = Справочники.ЛинииПоддержки.ПолучитьСсылку(Новый УникальныйИдентификатор());
		УстановитьСсылкуНового(СсылкаНового);
		СсылкаНаОбъект = ПолучитьСсылкуНового();
	Иначе
		СсылкаНаОбъект = Ссылка;
	КонецЕсли; 
	
	Если Не ОграничениеДоступаПоКомпонентам Тогда
		Возврат;
	КонецЕсли;
		
	ИсходноеНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Наименование");
	ЭтоСлужбаПоддержки = (Владелец = Справочники.ОбслуживающиеОрганизации.СлужбаПоддержки);
	
	Если Не ЗначениеЗаполнено(ГруппаМенеджеров) Тогда
		ГруппаМенеджеров = НоваяГруппаПользователей(
			СсылкаНаОбъект,
			?(ЭтоСлужбаПоддержки, 
				Справочники.ПрофилиГруппДоступа.МенеджерСлужбыПоддержки,
				Справочники.ПрофилиГруппДоступа.МенеджерОбслуживающейОрганизации),
				СтрШаблон(НСтр("ru='%1\%2\Менеджеры'"), Строка(Владелец), Наименование));
	ИначеЕсли Наименование <> ИсходноеНаименование Тогда
		Если ЗначениеЗаполнено(ГруппаМенеджеров) Тогда
			ГруппаМенеджеровОбъект = ГруппаМенеджеров.ПолучитьОбъект();
			ГруппаМенеджеровОбъект.Наименование = СтрШаблон(НСтр("ru='%1\%2\Менеджеры'"), Строка(Владелец), Наименование); 
			ГруппаМенеджеровОбъект.Записать();
		КонецЕсли; 
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ГруппаКонсультантов) Тогда
		ГруппаКонсультантов = НоваяГруппаПользователей(
			СсылкаНаОбъект,
			?(ЭтоСлужбаПоддержки, 
				Справочники.ПрофилиГруппДоступа.КонсультантСлужбыПоддержки, 
				Справочники.ПрофилиГруппДоступа.КонсультантОбслуживающейОрганизации),
				СтрШаблон(НСтр("ru='%1\%2\Консультанты'"), Строка(Владелец), Наименование));
	ИначеЕсли Наименование <> ИсходноеНаименование Тогда
		Если ЗначениеЗаполнено(ГруппаКонсультантов) Тогда
			ГруппаКонсультантовОбъект = ГруппаКонсультантов.ПолучитьОбъект();
			ГруппаКонсультантовОбъект.Наименование = СтрШаблон(НСтр("ru='%1\%2\Консультанты'"), Строка(Владелец), Наименование);
			ГруппаКонсультантовОбъект.Записать();
		КонецЕсли; 
	КонецЕсли; 
		
	Если (Не ЗначениеЗаполнено(ГруппаЭкспертов)) И ЭтоСлужбаПоддержки Тогда
		ГруппаЭкспертов = НоваяГруппаПользователей(
			СсылкаНаОбъект, Справочники.ПрофилиГруппДоступа.ЭкспертСлужбыПоддержки,
			СтрШаблон(НСтр("ru='%1\%2\Эксперты'"), Строка(Владелец), Наименование));
	ИначеЕсли Наименование <> ИсходноеНаименование Тогда
		Если ЗначениеЗаполнено(ГруппаЭкспертов) Тогда
			ГруппаЭкспертовОбъект = ГруппаЭкспертов.ПолучитьОбъект();
			ГруппаЭкспертовОбъект.Наименование = СтрШаблон(НСтр("ru='%1\%2\Эксперты'"), Строка(Владелец), Наименование);
			ГруппаЭкспертовОбъект.Записать();
		КонецЕсли; 
	КонецЕсли; 
	
	// Перезаполним права групп доступа к сервисам.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступаПользователи.Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|ГДЕ
	|	ГруппыДоступаПользователи.Пользователь В(&ГруппыПользователейЛП)";
	
	ГруппыПользователейЛП = Новый Массив;
	
	ГруппыПользователейЛП.Добавить(ГруппаКонсультантов);
	ГруппыПользователейЛП.Добавить(ГруппаМенеджеров);
	Если ЭтоСлужбаПоддержки Тогда
		ГруппыПользователейЛП.Добавить(ГруппаЭкспертов);
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ГруппыПользователейЛП", ГруппыПользователейЛП);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "ДоступныеСервисы, ДоступныеКомпоненты");
		ДоступныеСервисыОрганизации = РеквизитыОрганизации.ДоступныеСервисы.Выгрузить();
		ДоступныеКомпонентыОрганизации = РеквизитыОрганизации.ДоступныеКомпоненты.Выгрузить();
	КонецЕсли; 
	
	Пока Выборка.Следующий() Цикл
		
		ГруппаДоступаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если Наименование <> ИсходноеНаименование Тогда
			Если ГруппаДоступаОбъект.Пользователи.Найти(ГруппаМенеджеров) <> Неопределено Тогда
				ГруппаДоступаОбъект.Наименование = СтрШаблон(НСтр("ru='%1\%2\Менеджеры'"), Строка(Владелец), Наименование);
			ИначеЕсли ГруппаДоступаОбъект.Пользователи.Найти(ГруппаКонсультантов) <> Неопределено Тогда
				ГруппаДоступаОбъект.Наименование = СтрШаблон(НСтр("ru='%1\%2\Консультанты'"), Строка(Владелец), Наименование);
			ИначеЕсли ГруппаДоступаОбъект.Пользователи.Найти(ГруппаЭкспертов) <> Неопределено Тогда
				ГруппаДоступаОбъект.Наименование = СтрШаблон(НСтр("ru='%1\%2\Эксперты'"), Строка(Владелец), Наименование);
			КонецЕсли;
		КонецЕсли;
		
		Если Ссылка = Справочники.ОбслуживающиеОрганизации.СлужбаПоддержки Тогда
			ГруппаДоступаОбъект.Записать();
			Продолжить;
		КонецЕсли;
			
		// Перезаполним доступные сервисы
		ЗначенияДоступаСервис = ГруппаДоступаОбъект.ЗначенияДоступа.НайтиСтроки(
			Новый Структура("ВидДоступа", Справочники.Сервисы.ПустаяСсылка()));
		
		Для каждого Строка Из ЗначенияДоступаСервис Цикл
			ГруппаДоступаОбъект.ЗначенияДоступа.Удалить(Строка);
		КонецЦикла; 
		
		ВидыДоступаСервис = ГруппаДоступаОбъект.ВидыДоступа.НайтиСтроки(Новый Структура("ВидДоступа", Справочники.Сервисы.ПустаяСсылка()));
		
		Если ДоступныеСервисыОрганизации.Количество() = 0 Тогда
			Если ВидыДоступаСервис.Количество() > 0 Тогда
				ВидыДоступаСервис[0].ВсеРазрешены = Истина;
			КонецЕсли;
		Иначе
			Если ВидыДоступаСервис.Количество() > 0 Тогда
				ВидыДоступаСервис[0].ВсеРазрешены = Ложь;
			КонецЕсли;
			Для каждого Строка Из ДоступныеСервисыОрганизации Цикл
				ЗначениеДоступаСервис = ГруппаДоступаОбъект.ЗначенияДоступа.Добавить();
				ЗначениеДоступаСервис.ВидДоступа = Справочники.Сервисы.ПустаяСсылка();
				ЗначениеДоступаСервис.ЗначениеДоступа = Строка.Сервис;
			КонецЦикла;
		КонецЕсли;
		
		// Перезаполним доступные компоненты сервисов
		ЗначенияДоступаКомпоненты = ГруппаДоступаОбъект.ЗначенияДоступа.НайтиСтроки(
			Новый Структура("ВидДоступа", Справочники.КомпонентыСервиса.ПустаяСсылка()));
			
		Для каждого Строка Из ЗначенияДоступаКомпоненты Цикл
			ГруппаДоступаОбъект.ЗначенияДоступа.Удалить(Строка);
		КонецЦикла; 
			
		ВидыДоступаКомпоненты = ГруппаДоступаОбъект.ВидыДоступа.НайтиСтроки(Новый Структура("ВидДоступа", Справочники.КомпонентыСервиса.ПустаяСсылка()));
		
		Если Не ОграничениеДоступаПоКомпонентам Тогда
			Если ДоступныеКомпонентыОрганизации.Количество() = 0 Тогда
				Если ВидыДоступаКомпоненты.Количество() > 0 Тогда
					ВидыДоступаКомпоненты[0].ВсеРазрешены = Истина;
				КонецЕсли;
			Иначе
				Если ВидыДоступаКомпоненты.Количество() > 0 Тогда
					ВидыДоступаКомпоненты[0].ВсеРазрешены = Ложь;
				КонецЕсли;
				Для каждого Строка Из ДоступныеКомпонентыОрганизации Цикл
					ЗначениеДоступаСервис = ГруппаДоступаОбъект.ЗначенияДоступа.Добавить();
					ЗначениеДоступаСервис.ВидДоступа = Справочники.КомпонентыСервиса.ПустаяСсылка();
					ЗначениеДоступаСервис.ЗначениеДоступа = Строка.Компонент;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если ДоступныеКомпоненты.Количество() = 0 Тогда
				Если ВидыДоступаКомпоненты.Количество() > 0 Тогда
					ВидыДоступаКомпоненты[0].ВсеРазрешены = Истина;
				КонецЕсли;
			Иначе
				Если ВидыДоступаКомпоненты.Количество() > 0 Тогда
					ВидыДоступаКомпоненты[0].ВсеРазрешены = Ложь;
				КонецЕсли;
				Для каждого Строка Из ДоступныеКомпоненты Цикл
					ЗначениеДоступаСервис = ГруппаДоступаОбъект.ЗначенияДоступа.Добавить();
					ЗначениеДоступаСервис.ВидДоступа = Справочники.КомпонентыСервиса.ПустаяСсылка();
					ЗначениеДоступаСервис.ЗначениеДоступа = Строка.Компонент;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
			
		ГруппаДоступаОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ГруппаКонсультантов = Неопределено;
	ГруппаМенеджеров = Неопределено;
	ГруппаЭкспертов = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяГруппаПользователей(СсылкаНаОбъект, ПрофильДоступа, НаименованиеГруппы)
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "ДоступныеСервисы, ДоступныеКомпоненты");
	ДоступныеСервисыОрганизации = РеквизитыОрганизации.ДоступныеСервисы.Выгрузить();
	ДоступныеКомпонентыОрганизации = РеквизитыОрганизации.ДоступныеКомпоненты.Выгрузить();
	
	ГруппаДоступаОбъект = Справочники.ГруппыДоступа.СоздатьЭлемент();
	ГруппаДоступаОбъект.Наименование = НаименованиеГруппы;
	ГруппаДоступаОбъект.Профиль = ПрофильДоступа;
	ГруппаДоступаОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
	ВидДоступаОО = ГруппаДоступаОбъект.ВидыДоступа.Добавить();
	ВидДоступаОО.ВидДоступа = Справочники.ОбслуживающиеОрганизации.ПустаяСсылка();
	Если Владелец = Справочники.ОбслуживающиеОрганизации.СлужбаПоддержки Тогда
		ВидДоступаОО.ВсеРазрешены = Истина;
	Иначе
		ВидДоступаОО.ВсеРазрешены = Ложь;
		ЗначениеДоступаОО = ГруппаДоступаОбъект.ЗначенияДоступа.Добавить();
		ЗначениеДоступаОО.ВидДоступа = Справочники.ОбслуживающиеОрганизации.ПустаяСсылка();
		ЗначениеДоступаОО.ЗначениеДоступа = Владелец;
	КонецЕсли; 
	
	ВидДоступаСервис = ГруппаДоступаОбъект.ВидыДоступа.Добавить();
	ВидДоступаСервис.ВидДоступа = Справочники.Сервисы.ПустаяСсылка();
	
	Если Владелец = Справочники.ОбслуживающиеОрганизации.СлужбаПоддержки Тогда
		ВидДоступаСервис.ВсеРазрешены = Истина;
	Иначе
		Если ДоступныеСервисыОрганизации.Количество() = 0 Тогда
			ВидДоступаСервис.ВсеРазрешены = Истина;
		Иначе
			Для каждого Строка Из ДоступныеСервисыОрганизации Цикл
				ЗначениеДоступаСервис = ГруппаДоступаОбъект.ЗначенияДоступа.Добавить();
				ЗначениеДоступаСервис.ВидДоступа = Справочники.Сервисы.ПустаяСсылка();
				ЗначениеДоступаСервис.ЗначениеДоступа = Строка.Сервис;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ВидДоступаКомпонент = ГруппаДоступаОбъект.ВидыДоступа.Добавить();
	ВидДоступаКомпонент.ВидДоступа = Справочники.КомпонентыСервиса.ПустаяСсылка();
	
	Если Не ОграничениеДоступаПоКомпонентам Тогда
		Если Владелец = Справочники.ОбслуживающиеОрганизации.СлужбаПоддержки Тогда
			ВидДоступаКомпонент.ВсеРазрешены = Истина;
		Иначе
			Если ДоступныеКомпонентыОрганизации.Количество() = 0 Тогда
				ВидДоступаКомпонент.ВсеРазрешены = Истина;
			Иначе
				Для каждого Строка Из ДоступныеКомпонентыОрганизации Цикл
					ЗначениеДоступаСервис = ГруппаДоступаОбъект.ЗначенияДоступа.Добавить();
					ЗначениеДоступаСервис.ВидДоступа = Справочники.КомпонентыСервиса.ПустаяСсылка();
					ЗначениеДоступаСервис.ЗначениеДоступа = Строка.Компонент;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ДоступныеКомпоненты.Количество() = 0 Тогда
			ВидДоступаКомпонент.ВсеРазрешены = Истина;
		Иначе
			Для каждого Строка Из ДоступныеКомпоненты Цикл
				ЗначениеДоступаСервис = ГруппаДоступаОбъект.ЗначенияДоступа.Добавить();
				ЗначениеДоступаСервис.ВидДоступа = Справочники.КомпонентыСервиса.ПустаяСсылка();
				ЗначениеДоступаСервис.ЗначениеДоступа = Строка.Компонент;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	НоваяГруппаПользователей = Справочники.ГруппыПользователей.СоздатьЭлемент();
	НоваяГруппаПользователей.Наименование = НаименованиеГруппы;
	НоваяГруппаПользователей.Записать();
	НоваяГруппаПользователейСсылка = НоваяГруппаПользователей.Ссылка;
	
	ПользователиГруппы = ГруппаДоступаОбъект.Пользователи.Добавить();
	ПользователиГруппы.Пользователь = НоваяГруппаПользователейСсылка;
	
	ГруппаДоступаОбъект.Записать();
	
	Возврат НоваяГруппаПользователейСсылка;
	
КонецФункции 

#КонецОбласти

#КонецЕсли
