
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ДР = УРВПовтИспКлиентСервер.ПолучитьДоступностьРолей();

	Если Не ДР.ПолныеПрава И Не ДР.Экономист Тогда
		//+ Котова А.Ю. 29.05.2018 ТЗ№ 65671 {
		//Отбор = Новый Структура("Сотрудник", ОбщегоНазначения.ТекущийПользователь());
		Отбор = Новый Структура("Сотрудник", Пользователи.ТекущийПользователь());
		//- Котова А.Ю. 29.05.2018 ТЗ№ 65671 }
	    ПараметрыФормы = Новый Структура("Отбор", Отбор);
	    ОткрытьФорму("Отчет.АнализВыполненияПлана.Форма", ПараметрыФормы);
	Иначе
	    ОткрытьФорму("Отчет.АнализВыполненияПлана.Форма");
	КонецЕсли;	
КонецПроцедуры
