
Функция ПолучитьДанныеФормыДляОткрытия(ЗадачаУтверждения) Экспорт
	
	ДанныеФормыДляОткрытия = Новый Структура;
	ДанныеФормыДляОткрытия.Вставить("ИмяФормы");
	ДанныеФормыДляОткрытия.Вставить("ПараметрыФормы");
	
	Если ЗначениеЗаполнено(ЗадачаУтверждения) Тогда
		Если ЗадачаУтверждения.ТочкаМаршрута = БизнесПроцессы.УтверждениеВнеплановыхОтсутствий.ТочкиМаршрута.УтвердитьДокумент Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("БизнесПроцесс"		, ЗадачаУтверждения.БизнесПроцесс);
			ПараметрыФормы.Вставить("ТолькоПросмотр"		, Ложь);
			ПараметрыФормы.Вставить("Задача", ЗадачаУтверждения);
			ПараметрыФормы.Вставить("Ключ", ЗадачаУтверждения.Документ);
			
			ДанныеФормыДляОткрытия.ИмяФормы = "Документ.РегистрацияВнеплановыхОтсутствий.Форма.ФормаДокумента";
			ДанныеФормыДляОткрытия.ПараметрыФормы = ПараметрыФормы;
		КонецЕсли;
	КонецЕсли;	
	ВозВрат ДанныеФормыДляОткрытия;
	
КонецФункции