#Область Загрузка_Документов
Процедура ОбновитьСписокЗаданий() Экспорт
	Запрос = Новый Запрос( "ВЫБРАТЬ
	                       |	ОбъектыURMExchange.documentGUID КАК documentGUID,
	                       |	ОбъектыURMExchange.Контрагент КАК Контрагент,
	                       |	ОбъектыURMExchange.Пользователь КАК Пользователь,
	                       |	ОбъектыURMExchange.Проект КАК Проект,
	                       |	ОбъектыURMExchange.Комментарий КАК Комментарий,
	                       |	ОбъектыURMExchange.СрокС КАК СрокС,
	                       |	ОбъектыURMExchange.СрокПо КАК СрокПО,
	                       |	ОбъектыURMExchange.КрайнийСрок КАК КрайнийСрок,
	                       |	ОбъектыURMExchange.ПлановаяТрудоемкость КАК ПлановаяТрудоемкость,
	                       |	ОбъектыURMExchange.Состояние КАК Состояние,
	                       |	ОбъектыURMExchange.Наименование КАК Наименование,
	                       |	ОбъектыURMExchange.Дата КАК Дата,
	                       |	ОбъектыURMExchange.Номер КАК Номер
	                       |ИЗ
	                       |	РегистрСведений.ОбъектыURMExchange КАК ОбъектыURMExchange
	                       |ГДЕ
	                       |	НЕ ОбъектыURMExchange.Создан" );
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаписейЖурнала = Неопределено;
		
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанныхДокумента = URMExchangeСервер.ПолучитьДанныеПоGUID(Выборка.Проект,Выборка.Контрагент,Выборка.Пользователь, Выборка.documentGUID);
		
		Если Не ЗначениеЗаполнено(СтруктураДанныхДокумента.Проект) Тогда
			Сообщить__Ж("Создание документа Задание из регистра сведений", "Создание документа Задание "+ СокрЛП(Выборка.documentGUID)+" невозможно,проекта с GUID "+ СокрЛП(Выборка.Проект)+" нет в базе", МассивЗаписейЖурнала);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтруктураДанныхДокумента.Контрагент) Тогда
			Сообщить__Ж("Создание документа Задание из регистра сведений", "Создание документа Задание "+ СокрЛП(Выборка.documentGUID)+" невозможно,контрагента с GUID "+ СокрЛП(Выборка.Контрагент)+" нет в базе", МассивЗаписейЖурнала);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтруктураДанныхДокумента.Пользователь) Тогда
			Сообщить__Ж("Создание документа Задание из регистра сведений", "Создание документа Задание "+ СокрЛП(Выборка.documentGUID)+" невозможно,пользователя с GUID "+ СокрЛП(Выборка.Пользователь)+" нет в базе", МассивЗаписейЖурнала);
			Продолжить;
		КонецЕсли;
		
		
		НачатьТранзакцию();
		
		Если ЗначениеЗаполнено(СтруктураДанныхДокумента.ДокументЗадание) Тогда
			ОбъектЗадание = СтруктураДанныхДокумента.ДокументЗадание.ПолучитьОбъект();
		Иначе
			ОбъектЗадание  = Документы.Задание.СоздатьДокумент();
		КонецеСли;	
		ЗаполнитьЗначенияСвойств(ОбъектЗадание,Выборка);
		ОбъектЗадание.Сотрудник  = СтруктураДанныхДокумента.Пользователь;
		ОбъектЗадание.Контрагент = СтруктураДанныхДокумента.Контрагент;
		ОбъектЗадание.Проект     = СтруктураДанныхДокумента.Проект;
		ОбъектЗадание.GUIDОБД    = Выборка.documentGUID;
		
		Попытка
			РежимПроведения = РежимПроведенияДокумента.Неоперативный;
			ОбъектЗадание.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);
			
			ИзменитьЗаписьРегистраСведений(Выборка.documentGUID);
		Исключение
			ОтменитьТранзакцию();
			Сообщить__Ж("Создание документа Задание из регистра сведений", "Создание документа Задание  "+ СокрЛП(Выборка.documentGUID)+" невозможно.", МассивЗаписейЖурнала);
		КонецПопытки;
			
    КонецЦикла;
						
КонецПроцедуры	

#КонецОбласти

#Область Служебные_Функции
Процедура Сообщить__Ж(ИмяСобытия, ШаблонСообщения, МассивЗаписейЖурнала, Знач УровеньЖурнала = Неопределено) Экспорт
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурнала, , ,ШаблонСообщения)	
КонецПроцедуры

Процедура ИзменитьЗаписьРегистраСведений(documentGUID)
	НаборЗаписей = РегистрыСведений.ОбъектыURMExchange.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.documentGUID.Установить(documentGUID);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись_ из НаборЗаписей Цикл
		Запись_.Создан = Истина;
	КонецЦикла;
	
	Попытка 
		НаборЗаписей.Прочитать();
	Исключение
		Сообщить__Ж("Изменение записи регистра сведений ""ОбъектыURMExchange""",ОписаниеОшибки(),Неопределено);
	КонецПопытки;	
КонецПроцедуры	
#КонецОбласти







