
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
    
    Список.Параметры.УстановитьЗначениеПараметра("НизкаяВажность", Перечисления.ВариантыВажности.НизкаяВажность);
    Список.Параметры.УстановитьЗначениеПараметра("ВысокаяВажность", Перечисления.ВариантыВажности.ВысокаяВажность);
	Список.Параметры.УстановитьЗначениеПараметра("ТипКонсультация", Перечисления.ТипыОбращений.Консультация);
	Список.Параметры.УстановитьЗначениеПараметра("ТипОшибка", Перечисления.ТипыОбращений.Ошибка);
	Список.Параметры.УстановитьЗначениеПараметра("ТипПожелание", Перечисления.ТипыОбращений.Пожелание);
    
    Если Параметры.Свойство("Отбор") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("КарточкаБазыЗнаний", Параметры.Отбор.КарточкаБазыЗнаний);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если Не УправлениеДоступомУСПВызовСервера.ДоступныПользователиСервиса() Тогда
		Элементы.Инициатор.Видимость = Ложь;
	КонецЕсли;
    
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ФормаБизнесПроцессПоручениеСоздатьПоручение", Ложь);
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ГруппаПринятьКИсполнению", Ложь);
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ФормаЖурналДокументовВзаимодействияЗарегистрироватьЗвонок", Ложь);
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ФормаЖурналДокументовВзаимодействияНаписатьЭлектронноеПисьмо", Ложь);
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущаяДатаКлиента = ТекущаяДата();
	
	Список.Параметры.УстановитьЗначениеПараметра(
		"СекундДоМестногоВремени",
		ТекущаяДатаКлиента - УниверсальноеВремя(ТекущаяДатаКлиента));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
    
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
    
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ФормаБизнесПроцессПоручениеСоздатьПоручение", Элемент.ТекущаяСтрока <> Неопределено);
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ГруппаПринятьКИсполнению", Элемент.ТекущаяСтрока <> Неопределено);
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ФормаЖурналДокументовВзаимодействияЗарегистрироватьЗвонок", Элемент.ТекущаяСтрока <> Неопределено);
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ФормаЖурналДокументовВзаимодействияНаписатьЭлектронноеПисьмо", Элемент.ТекущаяСтрока <> Неопределено);
       
КонецПроцедуры

#КонецОбласти 
