
#Область ПрограммныйИнтерфейс
    
// Возвращает представление участника процесса. Если участником является роль,
// то в представление добавляются объекты адресации.
//
// Параметры:
//   Участник - СправочникСсылка.Пользователи;
//            - СправочникСсылка.РолиИсполнителей.
//   ОсновнойОбъектАдресации - ссылка на основной объект адресации исполнителя.
//   ДополнительныйОбъектАдресации - ссылка на дополнительный объект адресации исполнителя.
//
Функция ПредставлениеУчастникаПроцесса(Участник, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации) Экспорт
	
	Результат = Строка(Участник);
	
	Если ТипЗнч(Участник) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
		Если ЗначениеЗаполнено(ОсновнойОбъектАдресации) Тогда
			Результат = Результат + ", " + ОсновнойОбъектАдресации;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДополнительныйОбъектАдресации) Тогда
			Результат = Результат + ", " + ДополнительныйОбъектАдресации;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 
