
&НаСервере
Процедура ПроектПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭтапыПроектов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭтапыПроектов КАК ЭтапыПроектов
		|ГДЕ
		|	НЕ ЭтапыПроектов.ПометкаУдаления
		|	И ЭтапыПроектов.Владелец = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Запись.Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();
	
	Если ТаблицаЗначений.Количество() = 1 Тогда
		Запись.ЭтапПроекта = ТаблицаЗначений[0].Ссылка;
	Иначе
		Запись.ЭтапПроекта = Неопределено;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ПроектПриИзмененииНаСервере();
КонецПроцедуры
