
#Область ОбработчикиСобытий
    
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
    
	ИспользоватьКомпонентСервиса = Ложь;
	ИспользоватьЛиниюПоддержки = Ложь;
	ИспользоватьТипОбращения = Ложь;
	ИспользоватьСостояние = Ложь;
	ИспользоватьВажность = Ложь;
	ИспользоватьРаздел = Ложь;
	//+ Котова А.Ю. 06.11.2018 ТЗ№ 74355 {
	ИспользоватьАбонент = Ложь;
	ИспользоватьПроект = Ложь;
	//- Котова А.Ю. 06.11.2018 ТЗ№ 74355 }
	КлючевыеРеквизитыСтрокой = "";
	
	Для каждого Строка Из КлючевыеРеквизиты Цикл
		
		КлючевыеРеквизитыСтрокой = КлючевыеРеквизитыСтрокой + ?(ПустаяСтрока(КлючевыеРеквизитыСтрокой), "", "; ") + Строка.Реквизит;
		
		Если Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.ТипОбращения Тогда
			ИспользоватьТипОбращения = Истина;
            
        ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.Важность Тогда
			ИспользоватьВажность = Истина;
            
        ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.ЛинияПоддержки Тогда
			ИспользоватьЛиниюПоддержки = Истина;
            
        ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.КомпонентСервиса Тогда
			ИспользоватьКомпонентСервиса = Истина;
            
        ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.Раздел Тогда
			ИспользоватьРаздел = Истина;
            
        ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.СостояниеОбращения Тогда
			ИспользоватьСостояние = Истина;
			//+ Котова А.Ю. 06.11.2018 ТЗ№ 74355 {
		ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.Абонент Тогда
			ИспользоватьАбонент = Истина;
		ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.Проект Тогда
			ИспользоватьПроект = Истина;
			//- Котова А.Ю. 06.11.2018 ТЗ№ 74355 }
        КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Оповещение Из Оповещения Цикл
		Если Не ЗначениеЗаполнено(СокрЛП(Оповещение.КлючОповещения)) Тогда
			Оповещение.КлючОповещения = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Для каждого Строка Из ПараметрыСоглашения Цикл
		СтрокиПеренаправления = Перенаправления.НайтиСтроки(Новый Структура("КлючПараметров", Строка.КлючПараметров));
		СтрокиОповещений = Оповещения.НайтиСтроки(Новый Структура("КлючПараметров", Строка.КлючПараметров));
		
		НовыйКлючПараметров = Строка(Новый УникальныйИдентификатор);
		Строка.КлючПараметров = НовыйКлючПараметров;
		Для каждого Строка Из СтрокиПеренаправления Цикл
			Строка.КлючПараметров = НовыйКлючПараметров;
		КонецЦикла; 
		Для каждого Строка Из СтрокиОповещений Цикл
			Строка.КлючПараметров = НовыйКлючПараметров;
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
    
    Если ОбменДанными.Загрузка = Истина Тогда
        Возврат;
    КонецЕсли;
    
    Справочники.Соглашения.ЗапуститьРасчетСроковОбращенийВФоне(Ссылка);
    
КонецПроцедуры

#КонецОбласти 
