
#Область ПрограммныйИнтерфейс
    
// Открывает форму выбора шаблона бизнес-процесса.
//
// Параметры:
//  ДоступныеЭлементы  - СписокЗначений - элементы, доступный для выбора.
//  ОписаниеОповещения - ОписаниеОповещения - действие, после выполнения выбора. 
//
Процедура ВыбратьШаблонБизнесПроцесса(ДоступныеЭлементы = Неопределено, ОписаниеОповещения = Неопределено) Экспорт
    
    ПараметрыФормы = Новый Структура;
    
	Если ТипЗнч(ДоступныеЭлементы) = Тип("СписокЗначений") И ДоступныеЭлементы.Количество() > 0 Тогда 
		ПараметрыФормы.Вставить("ДоступныеЭлементы", ДоступныеЭлементы);
	КонецЕсли;
    
    ОткрытьФорму("Справочник.ШаблоныПоручений.ФормаВыбора", ПараметрыФормы,,,,, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти 
