
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БоР_ОбщийМодуль.ЗаполнитьРеквизитыИзПараметров(ЭтаФорма, Неопределено);
	Если ЗначениеЗаполнено(ОписаниеXML) Тогда
		ОписаниеФД = БоР_ОбщийМодуль.ЗначениеИзXML(ОписаниеXML);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОписаниеXML = БоР_ОбщийМодуль.ЗначениеВXML(ОписаниеФД);
	ОписаниеТекст = ОписаниеФД.ПолучитьТекст();
	СтруктураВозВрата = Новый Структура;
	СтруктураВозВрата.Вставить("ОписаниеXML"				, ОписаниеXML);
	СтруктураВозВрата.Вставить("ОписаниеФД"					, ОписаниеФД);
	СтруктураВозВрата.Вставить("ОписаниеТекст"				, ОписаниеТекст);
	Закрыть(СтруктураВозВрата);
КонецПроцедуры
