
#Область ОбработчикиСобытийФормы
    
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЗначенияСервиса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "УчетнаяЗаписьСлужбыПоддержкиПоУмолчанию, ПерваяЛиния");
    Если ЗначениеЗаполнено(ЗначенияСервиса.ПерваяЛиния) Тогда
        Элементы.ПерваяЛиния.ПодсказкаВвода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
            НСтр("ru='Как у сервиса: %1'"), ЗначенияСервиса.ПерваяЛиния);
    КонецЕсли; 
    Если ЗначениеЗаполнено(ЗначенияСервиса.УчетнаяЗаписьСлужбыПоддержкиПоУмолчанию) Тогда
        Элементы.УчетнаяЗапись.ПодсказкаВвода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
            НСтр("ru='Как у сервиса: %1'"), ЗначенияСервиса.УчетнаяЗаписьСлужбыПоддержкиПоУмолчанию);
    КонецЕсли; 

КонецПроцедуры

#КонецОбласти 
