
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивДанных") Тогда
		Для Каждого СтрокаДанных Из Параметры.МассивДанных Цикл
			СтрокаXDTO = ТаблицаКонтрагентов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаXDTO,СтрокаДанных);
			СтрокаXDTO.GUIDPartner = Новый УникальныйИдентификатор(СтрокаДанных.GUIDPartner);
		КонецЦикла;
	КонецЕсли;
	Если Параметры.Свойство("Источник") Тогда
		Источник = Параметры.Источник;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыборЗначения();  
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборЗначения();
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначения()
	ТекДанные = Элементы.ТаблицаКонтрагентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
    ЗаписатьОбъект(ТекДанные.GUIDPartner, ТекДанные.INN, ТекДанные.Name);	
	
	Этаформа.Закрыть();
КонецПроцедуры	

&НаСервере
Процедура ЗаписатьОбъект(GUIDPartner, INN, Name)
	ИсточникОбъект = Источник.ПолучитьОбъект();
	ИсточникОбъект.GUIDОБД = GUIDPartner;
	ИсточникОбъект.Наименование = Name;
	ИсточникОбъект.ИНН = INN;
	Попытка
		ИсточникОбъект.Записать();
	Исключение
		Сообщить("Не удалось обновить данные по причине: " + ОписаниеОшибки());
	КонецПопытки;	
КонецПроцедуры	
	
	
	