
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для Каждого СтрокаРаботы Из Работы Цикл
		Если СтрокаРаботы.Дата > КонецДня(ДатаОкончанияПериода) Тогда
			СообщениеПользователю("Дата выполнения работ не может превышать дату окончания периода!", "Объект.Работы[" + (СтрокаРаботы.НомерСтроки - 1) + "].Дата");
			Отказ = Истина;
		КонецЕсли;
		Если СтрокаРаботы.Дата < НачалоДня(ДатаНачалаПериода) Тогда
			СообщениеПользователю("Дата выполнения работ не может быть меньше даты начала периода!", "Объект.Работы[" + (СтрокаРаботы.НомерСтроки - 1) + "].Дата");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаРаботы Из ДанныеЛУРВ Цикл
		Если СтрокаРаботы.Дата > КонецДня(ДатаОкончанияПериода) Тогда
			СообщениеПользователю("Дата выполнения работ не может превышать дату окончания периода!", "Объект.ДанныеЛУРВ[" + (СтрокаРаботы.НомерСтроки - 1) + "].Дата");
			Отказ = Истина;
		КонецЕсли;
		Если СтрокаРаботы.Дата < НачалоДня(ДатаНачалаПериода) Тогда
			СообщениеПользователю("Дата выполнения работ не может быть меньше даты начала периода!", "Объект.ДанныеЛУРВ[" + (СтрокаРаботы.НомерСтроки - 1) + "].Дата");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура СообщениеПользователю(Текст,Поле)
	Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = Текст;
	Сообщение.Поле = Поле;
	Сообщение.Сообщить();
КонецПроцедуры	