
Процедура ПриЗаписи(Отказ)
	//Проверить справочник Работы. Если в нем нет ни одной работы, ссылающийся на этот вид работ, создаем ее.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Работы.Ссылка
		|ИЗ
		|	Справочник.Работы КАК Работы
		|ГДЕ
		|	Работы.ВидыРабот = &Ссылка
		|	И НЕ Работы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		СпрРабота = Справочники.Работы.СоздатьЭлемент();
		СпрРабота.Наименование = Ссылка.Наименование;
		СпрРабота.ВидРаботы = Ссылка.ВидРаботы;
		СпрРабота.ДляТабеля = Ссылка.ДляТабеля;
		СпрРабота.ОсновнаяСтатья = Ссылка.ОсновнаяСтатья;
		СпрРабота.ОсновнойПроект = Ссылка.ОсновнойПроект;
		СпрРабота.ПолноеНаименование = Ссылка.ПолноеНаименование;
		СпрРабота.ВидыРабот = Ссылка;
		СпрРабота.Записать();
	КонецЕсли;

КонецПроцедуры
