
#Область ОбработчикиСобытийФормы
    
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда 
		Объект.Пользователь = Пользователи.ТекущийПользователь();
    КонецЕсли;
    
    Элементы.Голос.Видимость = Не РольДоступна(Метаданные.Роли.ПолныеПрава);
    Элементы.ГолосЧислом.Видимость = РольДоступна(Метаданные.Роли.ПолныеПрава);
    
    Если Объект.Голос > 1 Или Объект.Голос < -1 Тогда
        Элементы.Голос.Видимость = Ложь;
        Элементы.ГолосЧислом.Видимость = Истина;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти
