
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если РольДоступна("Сотрудник") Тогда
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДатаНачалаПроекта", Параметры.ДатаСреза, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДатаОкончанияПроекта", Параметры.ДатаСреза, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
		//Если ЗначениеЗаполнено(Параметры.Проект) Тогда 
		//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", Параметры.Проект, ВидСравненияКомпоновкиДанных.Равно);
		//КонецЕсли;	
	//КонецЕсли;	
КонецПроцедуры
