
&НаКлиенте
Процедура ЗаполнитьСтарымиСтавками(Команда)
	Если ПроверитьЗаполнение()Тогда
		ЗаполнитьСтарымиСтавкамиНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтарымиСтавкамиНаСервере()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(УстановкаСтавокСтавки.Ссылка.Дата) КАК Дата,
		|	УстановкаСтавокСтавки.Должность КАК Должность,
		|	УстановкаСтавокСтавки.Ссылка.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТ_ПоследнийДок
		|ИЗ
		|	Документ.УстановкаСтавок.Ставки КАК УстановкаСтавокСтавки
		|ГДЕ
		|	УстановкаСтавокСтавки.Должность = &Должность
		|	И УстановкаСтавокСтавки.Ссылка.Подразделение = &Подразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаСтавокСтавки.Ссылка.Подразделение,
		|	УстановкаСтавокСтавки.Должность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкиСотрудниковПоВидамРаботСрезПоследних.ВидРаботы КАК ВидРаботы,
		|	СтавкиСотрудниковПоВидамРаботСрезПоследних.Ставка КАК СтавкаСтарая,
		|	СтавкиСотрудниковПоВидамРаботСрезПоследних.Регистратор КАК Регистратор,
		|	СтавкиСотрудниковПоВидамРаботСрезПоследних.Регистратор.Дата КАК РегистраторДата
		|ИЗ
		|	ВТ_ПоследнийДок КАК ВТ_ПоследнийДок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиСотрудниковПоВидамРабот.СрезПоследних КАК СтавкиСотрудниковПоВидамРаботСрезПоследних
		|		ПО ВТ_ПоследнийДок.Дата = СтавкиСотрудниковПоВидамРаботСрезПоследних.Период
		|			И ВТ_ПоследнийДок.Должность = СтавкиСотрудниковПоВидамРаботСрезПоследних.Должность
		|			И ВТ_ПоследнийДок.Подразделение = СтавкиСотрудниковПоВидамРаботСрезПоследних.Подразделение
		|ГДЕ
		|	СтавкиСотрудниковПоВидамРаботСрезПоследних.Подразделение = &Подразделение
		|	И СтавкиСотрудниковПоВидамРаботСрезПоследних.Должность = &Должность";
	
	Запрос.УстановитьПараметр("Должность", Объект.Должность);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Объект.Ставки.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Сч = 0;
	Для каждого стр из Объект.Ставки цикл
		Если НЕ ЗначениеЗаполнено(стр.СтавкаНовая) ТОгда
			Сч = сч+1;
		КонецЕсли;
	КонецЦикла;
	
	Если Сч > 0 Тогда 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
	      ЭтотОбъект);	
	 
	    ПоказатьВопрос(Оповещение,
	        "В ТЧ есть виды работ без установленного значения новых ставок, по таким видам работ ставки НЕ будут установлены. Продолжить?",
	        РежимДиалогаВопрос.ДаНетОтмена,
	        0, // таймаут в секундах
	        КодВозвратаДиалога.Да, 
			КодВозвратаДиалога.Нет 
	    );
	Иначе
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        СформироватьНаСервере();
    КонецЕсли;	
 
КонецПроцедуры


&НаСервере
Процедура СформироватьНаСервере()
	
	НовыйДокумент = Документы.УстановкаСтавок.СоздатьДокумент();
	НовыйДокумент.Подразделение = Объект.Подразделение;
	НовыйДокумент.Регион = Справочники.Регионы.Новосибирск;
	НовыйДокумент.Дата = ТекущаяДата();
	
	Для каждого стр из Объект.Ставки цикл
		Если ЗначениеЗаполнено(Стр.ставкаНовая) Тогда
			ТЧДокумента = НовыйДокумент.Ставки.Добавить();
			ТЧДокумента.ВидРаботы = стр.ВидРаботы;
			ТЧДокумента.Должность = Объект.Должность;
			ТЧДокумента.Ставка = Стр.ставкаНовая;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Документ сформирован успешно!");
	Исключение
		Сообщить("Ошибка! " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьНовуюСтавку(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", 
      ЭтотОбъект);	
 
    ПоказатьВводЗначения(
        Оповещение,
        , 
        "Введите новую ставку",
        "Число"
    );
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(Результат, Параметры) Экспорт	
 
    Если Не Результат = Неопределено Тогда
        ЗаполнитьНовуюСтавкуНаСервере(Результат);		
    КонецЕсли;
 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНовуюСтавкуНаСервере(НоваяСтавка)
	ДЛя Каждого Стр из элементы.ставки.ВыделенныеСтроки цикл
		Строка = объект.Ставки.НайтиПоИдентификатору(Стр);
		Строка.СтавкаНовая = НоваяСтавка;
	КонецЦикла;
КонецПроцедуры
