
#Область ПрограммныйИнтерфейс

// Возвращает список пользовательских функций для автоподстановки 
// исполнителей в шаблонах бизнес-процессов.
//
Функция СписокДоступныхФункций() Экспорт
	
	ДоступныеФункции = Новый СписокЗначений;
    
    // Пример использования:
    //  ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.<ИмяФункции>(Объект)", 
    //                            "<Представление функции>");
	
	Возврат ДоступныеФункции;
	
КонецФункции

#КонецОбласти