
&НаКлиенте
Процедура МесяцРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Направление = 1 Тогда
		Объект.Месяц = КонецМесяца(Объект.Месяц) + 1;
	Иначе
		Объект.Месяц = НачалоМесяца(Объект.Месяц) - 1;
	КонецЕсли;
	
	Объект.МесяцСтрокой = Формат(Объект.Месяц, "ДФ = ""гггг ММММ""");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Месяц = НачалоМесяца(ТекущаяДата());
		Объект.МесяцСтрокой = Формат(Объект.Месяц, "ДФ = ""гггг ММММ""");
	КонецЕсли;	
КонецПроцедуры
