
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сервис = Параметры.Сервис;
	
	Список.Параметры.УстановитьЗначениеПараметра("Сервис", Параметры.Сервис);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Копирование Тогда
		
		Отказ = Истина;
		
		ПараметрыФормы = Новый Структура("Сервис", Сервис);
		Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
			ПараметрыФормы.Вставить("Основание",Элементы.Список.ТекущиеДанные.Ссылка);
		КонецЕсли;
		ОткрытьФорму("Справочник.Разделы.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
