
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
    
    Для каждого Элемент Из Параметры.КлючевыеРеквизиты Цикл
		КлючевойРеквизит = КлючевыеРеквизиты.Добавить(Элемент.Значение);
		КлючевойРеквизит.Пометка = Истина;
	КонецЦикла;
	
    ЗапросКлючевыхРеквизитов = Новый Запрос;
    ЗапросКлючевыхРеквизитов.Текст =
        "ВЫБРАТЬ
        |   КлючевыеРеквизиты.Ссылка
        |ИЗ
        |   ПланВидовХарактеристик.КлючевыеРеквизитыОбращений КАК КлючевыеРеквизиты
        |ГДЕ
        |   НЕ КлючевыеРеквизиты.ПометкаУдаления";
	
	//+ Котова А.Ю. 24.10.2018 ТЗ№ 74355 {
    //ДоступныеКлючевыеРеквизиты = ЗапросКлючевыхРеквизитов.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ДоступныеКлючевыеРеквизитыВсяТаблица = ЗапросКлючевыхРеквизитов.Выполнить().Выгрузить();
	ДоступныеКлючевыеРеквизитыВсяТаблица.Сортировать("Ссылка");
	ДоступныеКлючевыеРеквизиты = ДоступныеКлючевыеРеквизитыВсяТаблица.ВыгрузитьКолонку("Ссылка");
	//- Котова А.Ю. 24.10.2018 ТЗ№ 74355 }
	Для Каждого КлючевойРеквизит Из ДоступныеКлючевыеРеквизиты Цикл
		Если КлючевыеРеквизиты.НайтиПоЗначению(КлючевойРеквизит) = Неопределено Тогда
			КлючевыеРеквизиты.Добавить(КлючевойРеквизит);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВыбранныеЗначения = Новый Массив;
	Для каждого Элемент Из КлючевыеРеквизиты Цикл
		Если Элемент.Пометка Тогда
			ВыбранныеЗначения.Добавить(Элемент.Значение);
		КонецЕсли; 
	КонецЦикла; 
	
	Закрыть(ВыбранныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти 

