
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если (Запись.Роль <> ПредопределенноеЗначение("Перечисление.РолиСотрудниковЛК.Сотрудник")) Тогда
			Запись.ДоступноСоздание						= Ложь;	
			Запись.ДоступноИзменение					= Ложь;	
			Запись.ДоступноПерепланирование				= Ложь;
			Запись.ДоступноБлокировка					= Ложь;
			Запись.ДоступноОтменаБлокировки				= Ложь;
			//Лобашова 30.05.2019 87280 +
			Запись.ДоступноПросмотрДругихСотрудников	= Ложь;
			//Лобашова 30.05.2019 87280 -
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры
