

//==================================================================================================
#Область СобытияФормы
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступРольПриИзменении();
	
КонецПроцедуры

#КонецОбласти


//==================================================================================================
#Область СобытияЭлементовФормы
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура РольПриИзменении(Элемент)
	
	УстановитьВидимостьДоступРольПриИзменении();
	
КонецПроцедуры

#КонецОбласти

//==================================================================================================
#Область СобытияОбщегоНазначения
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура УстановитьВидимостьДоступРольПриИзменении()
	
	Элементы.ГруппаСамоорганизацияСотрудника.Доступность = (Запись.Роль = ПредопределенноеЗначение("Перечисление.РолиСотрудниковЛК.Сотрудник"));
	
КонецПроцедуры

#КонецОбласти


//==================================================================================================



