
#Область ПрограммныйИнтерфейс
    
// Возвращает значение константы ИспользоватьАдресПубликацииПриложенияВУведомлениях.
//
Функция ИспользоватьАдресПубликацииПриложенияВУведомлениях() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.ИспользоватьАдресПубликацииПриложенияВУведомлениях.Получить();
	
КонецФункции

// Возвращает значение константы АдресПубликацииИнформационнойБазыВИнтернете.
//
Функция АдресПубликацииИнформационнойБазыВИнтернете() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить();
	
КонецФункции

#КонецОбласти 
