
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПринятьВРаботу(Команда)
	
    Ссылки = ОбслуживаниеКлиент.СсылкиИзСтрокСписка(Элементы.Список.ВыделенныеСтроки);
    ПринятьВРаботуНаСервере(Ссылки);
	ОбслуживаниеКлиент.ПринятьПожеланияВРаботуЗавершение(Ссылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиНаЛинию(Команда)
	
    Ссылки = ОбслуживаниеКлиент.СсылкиИзСтрокСписка(Элементы.Список.ВыделенныеСтроки);
    ПеревестиНаЛиниюНаСервере(Ссылки);
	ОбслуживаниеКлиент.ПеревестиПожеланияНаЛиниюЗавершение(Ссылки);
	
КонецПроцедуры

&НаКлиенте
Процедура Перенаправить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПеренаправитьЗавершение", ЭтотОбъект);
   	Объекты = Элементы.Список.ВыделенныеСтроки; 
    ОбслуживаниеКлиент.ПеренаправитьОбъекты(Объекты, Тип("СправочникСсылка.Пожелания"), Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПринятьВРаботуНаСервере(Ссылки)
    
	Обслуживание.ПринятьОбъектыВРаботу(Ссылки, Элементы.Список);
	
КонецПроцедуры

&НаСервере
Процедура ПеревестиНаЛиниюНаСервере(Ссылки)
    
	Обслуживание.ПеревестиОбъектыНаЛинию(Ссылки, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренаправитьЗавершение(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОповеститьОбИзменении(Тип("СправочникСсылка.Пожелания"));
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
