#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет оповещение по обращению
//
// Параметры:
//  Параметры - Структура - параметры оповещения:
//  * Обращение - ДокументСсылка.Обращение - обращение оповещения.
//  * Соглашение - СправочникСсылка.Соглашения - соглашение оповещения.
//  * КлючПараметров - Строка(36) - ключ параметров.
//  * КлючОповещения - Строка(36) - ключ оповещения.
//
Процедура ДобавитьОповещение(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Менеджер = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Менеджер, Параметры, "Обращение, Соглашение, КлючПараметров, КлючОповещения");
	Менеджер.Записать();
	
КонецПроцедуры

// Удаляет оповещения по обращению
//
// Параметры:
//  Обращение - ДокументСсылка.Обращение - обращение оповещения.
//
Процедура УдалитьОповещенияПоОбращению(Обращение) Экспорт
	
	НаборЗаписей = РегистрыСведений.ОтправленныеОповещенияПоСоглашениям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Обращение.Установить(Обращение, Истина);
	НаборЗаписей.Записать();
	
КонецПроцедуры
  
#КонецОбласти 

#КонецЕсли 