#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись по переданным параметрам
//
Процедура ДобавитьЗапись(Период, Обращение, Состояние) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Менеджер = РегистрыСведений.ИсторияСостоянийОбращений.СоздатьМенеджерЗаписи();
	Менеджер.Период = Период;
	Менеджер.Обращение = Обращение;
	Менеджер.Состояние = Состояние;
	Менеджер.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
