
&НаКлиенте
Процедура ОК(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		ВозВрат;
	КонецЕсли;
	УстанавливаемыеСвойства = Новый Структура;
	УстанавливаемыеСвойства.Вставить("ДоступноДляСамозаписи"				, ДоступноДляСамозаписи);
	
	СтруктураВозВрата = Новый Структура;
	СтруктураВозВрата.Вставить("УстанавливаемыеСвойства"	, УстанавливаемыеСвойства);
	Закрыть(СтруктураВозВрата);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БоР_ОбщийМодуль.ЗаполнитьРеквизитыИзПараметров(ЭтаФорма, Неопределено);
КонецПроцедуры
