////////////////////////////////////////////////////////////////////////////////
// Подсистема "ПодсистемыЦККВМоделиСервиса".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Список поддерживаемых типов инцидентов (переопределяемый)
//
// Параметры:
//  СписокТипов	 - Соответствие - Ключ: строка(100) с именем типа, Значение: структура со строковыми полями
//		УровеньИнцидента, Подсистема, Теги, ПроцедураПроверки									
//
Процедура СписокТиповИнцидентовПереопределяемый(СписокТипов) Экспорт
	
	ИнцидентыЦККСлужбыПоддержки.СписокТиповИнцидентовМенеджерСервиса(СписокТипов);
	
КонецПроцедуры

// В процедуре можно вызвать все прикладные проверки, связанные с периодическим мониторингом прикладной конфигурации.
// Процедура вызывается с помощью регламентной процедуры МониторингЦКК раз в минуту, если константа АдресЦКК заполнена.
//
Процедура ВыполнитьЗадачиМониторингаЦКК() Экспорт
	
	ИнцидентыЦККСлужбыПоддержки.ВыполнитьЗадачиМониторингаЦКК();
	
КонецПроцедуры

#КонецОбласти

