
#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Или Не ЗначениеЗаполнено(Объект.Период) Тогда
		Объект.Период = НачалоМесяца(ТекущаяДата());
	КонецЕсли;	
	ЭтотОбъект.ПериодСтрокой = Формат(Объект.Период, "ДФ = ""гггг ММММ""");
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.Период = НачалоМесяца(Объект.Период);
	ПроверитьПериодПоПроекту();
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	УстановитьДоступность();
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		Объект.ЭтапПроекта = УРВСервер.НайтиОсновнойЭтапДляПодстановкиВДокументы(Объект.Проект);
	Иначе
		Объект.ЭтапПроекта = ПредопределенноеЗначение("Справочник.ЭтапыПроектов.ПустаяСсылка");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого СтрокаСотрудник из Объект.Показатели Цикл
		ЗаполнитьДанныеПоСотруднику(СтрокаСотрудник.НомерСтроки-1);
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ПересчитатьСуммуПоСтроке(СтрокаСотрудник.Ставка,СтрокаСотрудник.Оклад,СтрокаСотрудник.Время,Объект.Период);
		КонецЕсли;
	КонецЦикла;
	ИтогоПоПроекту = Объект.Показатели.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиСотрудникПриИзменении(Элемент)
	ТекущиеДанные               = Элементы.Показатели.ТекущиеДанные;
	ЗаполнитьДанныеПоСотруднику(Элементы.Показатели.ТекущаяСтрока);
	ПересчитатьСуммуПоСтроке(ТекущиеДанные.Ставка,ТекущиеДанные.Оклад,ТекущиеДанные.Время,Объект.Период);
	ИтогоПоПроекту              = Объект.Показатели.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиВремяПриИзменении(Элемент)
	ТекущиеДанные        = Элементы.Показатели.ТекущиеДанные;
	ТекущиеДанные.Сумма  = ПересчитатьСуммуПоСтроке(ТекущиеДанные.Ставка,ТекущиеДанные.Оклад,ТекущиеДанные.Время,Объект.Период);
	ИтогоПоПроекту       = Объект.Показатели.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не Копирование И НоваяСтрока Тогда
		ТекДанные = Элементы.Показатели.ТекущиеДанные;
		ТекДанные.Статья = ЗаполнитьСтатьюНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Направление = 1 Тогда
		Объект.Период = КонецМесяца(Объект.Период) + 1;
	Иначе
		Объект.Период = НачалоМесяца(НачалоМесяца(Объект.Период) - 1);
	КонецЕсли;
	
	ЭтотОбъект.ПериодСтрокой = Формат(Объект.Период, "ДФ = ""гггг ММММ""");
	
    ПроверитьПериодПоПроекту();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Для Каждого СтрокаСотрудник из Объект.Показатели Цикл
		ЗаполнитьДанныеПоСотруднику(СтрокаСотрудник.НомерСтроки-1);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ
&НаСервере
Процедура УстановитьДоступность()
	Элементы.ПоказателиКонтрагентАбонент.Видимость = ?(Объект.Проект.УчетПоКонтрагентам,Истина,Ложь);
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьДанныеПоСотруднику(НомерСтроки)
	Структура_                                   = СотрудникиСервер.ТекущаяСтавкаСотрудникаДолжностьПодразделение(Объект.Показатели[НомерСтроки].Сотрудник,Объект.Дата,Объект.Показатели[НомерСтроки].Статья);
	Объект.Показатели[НомерСтроки].Ставка        = Структура_.Ставка;
	Объект.Показатели[НомерСтроки].Оклад         = Структура_.Оклад;
	Объект.Показатели[НомерСтроки].Должность     = Структура_.Должность;
    Объект.Показатели[НомерСтроки].Подразделение = Структура_.Подразделение;
КонецПроцедуры	

&НаСервере
Функция ПересчитатьСуммуПоСтроке(Ставка, Оклад, Время, Период)
	Если Период = Дата(1,1,1) Тогда
		Возврат 0
	КонецЕсли;	
	НормаЧасовВМесяц = СотрудникиСервер.ПолучитьНормуЧасовВПериоде(НачалоМесяца(Период),КонецМесяца(Период));
	Возврат (Ставка * Время) + (Оклад * Время/НормаЧасовВМесяц);
КонецФункции

&НаСервере
Процедура ПроверитьПериодПоПроекту()
	Если Объект.Период < Объект.Проект.ДатаНачала Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата начала периода меньше, чем дата начала проекта";
		Сообщение.Поле = "Период";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
	КонецЕсли;
	Если Объект.Период > Объект.Проект.ДатаОкончания Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата окончания периода больше, чем дата окончания проекта";
		Сообщение.Поле = "Период";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ЗаполнитьСтатьюНаСервере()
	Возврат Объект.Проект.ОсновнаяСтатья;
КонецФункции	


#КонецОбласти