
&НаКлиенте
Процедура НовоеВремяПриИзменении(Элемент)
	НовыеЧасы = ВремяВЧасы(НовоеВремя);
КонецПроцедуры

&НаКлиенте
Процедура НовыеЧасыПриИзменении(Элемент)
	НовоеВремя = ЧасыВоВремя(НовыеЧасы);
КонецПроцедуры

&НаСервере
Функция ЧасыВоВремя(Часы, ДатаВремя = '00010101')
	Время = ДатаВремя + Часы * 3600;
	Возврат ?(Секунда(Время) < 30, НачалоМинуты(Время), КонецМинуты(Время) + 1);
КонецФункции

&НаСервере
Функция ВремяВЧасы(Время) Экспорт
	Возврат (Время - '00010101') / 3600;
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Новый Структура("НовыеЧасы, НовоеВремя", НовыеЧасы, НовоеВремя));
КонецПроцедуры


