
#Область ОбработчикиСобытийФормы
    
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Сервис) Тогда
		Если ЗначениеЗаполнено(Запись.ПользовательСервиса) Тогда
			Запись.Сервис = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ПользовательСервиса,"Владелец");
		ИначеЕсли ЗначениеЗаполнено(Запись.Абонент) Тогда
			Запись.Сервис = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Абонент,"Владелец");
		КонецЕсли;  
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 
