
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.СписокШаблонов.Количество() = 1 Тогда
		
		Шаблон = Параметры.СписокШаблонов[0].Значение;
		
		Элементы.ДекорацияТекстСообщения.Заголовок = НСтр("ru='Для этой карточки рекомендуется сразу запустить процесс по шаблону:'");
		
	КонецЕсли;	
		
	Команды.ОткрытьШаблон.Заголовок = Строка(Шаблон) + " (" 
		+ ОбщегоНазначения.МенеджерОбъектаПоСсылке(Шаблон).ИмяПроцесса(Шаблон) + ")";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьПроцесс(Команда)
	
	СделатьВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьШаблон(Команда)
	
	ПоказатьЗначение(, Шаблон);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СделатьВыбор()
	
	Закрыть(Шаблон);
	
КонецПроцедуры

#КонецОбласти

