
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Дата, Автор, ЛинияПоддержки, Комментарий, ВнутренняяПереписка, ВыбраннаяСтрока");
	
	Если Пользователи.АвторизованныйПользователь() = Автор Или Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.Комментарий.ТолькоПросмотр = Ложь;
		Элементы.ВнутренняяПереписка.ТолькоПросмотр = Ложь;
		Элементы.ГруппаКнопки.Видимость = Истина;
	КонецЕсли;
	
	СведенияОПользователе = РегистрыСведений.СведенияОПользователях.СведенияОПользователе();
	Если СведенияОПользователе.ОбслуживающаяОрганизация = Справочники.ОбслуживающиеОрганизации.СлужбаПоддержки Или 
		Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.ВнутренняяПереписка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры
    
#КонецОбласти

#Область ОбработчикиКомандФормы
    
&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Дата", Дата);
	Результат.Вставить("Автор", Автор);
	Результат.Вставить("ЛинияПоддержки", ЛинияПоддержки);
	Результат.Вставить("Комментарий", Комментарий);
	Результат.Вставить("ВнутренняяПереписка", ВнутренняяПереписка);
	Результат.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
	
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти 
