#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр по переданным параметрам.
//
// Параметры:
//  Обращение      - ДокументСсылка.Обращение - 
//  ЕстьОбновление - Булево - признак наличия обновления 
//
Процедура ДобавитьЗапись(Обращение, ЕстьОбновление) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Менеджер = РегистрыСведений.НаличиеОбновленийОбращений.СоздатьМенеджерЗаписи();
	Менеджер.Обращение = Обращение;
	Менеджер.ЕстьОбновление = ЕстьОбновление;
	Менеджер.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
