
&НаКлиенте
Процедура Считать(Команда)
	СчитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СчитатьНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.СчитатьПользователейНаСервере();
	ЗначениеВРеквизитФормы(Об, "Объект");	
КонецПроцедуры

Функция ПолучитьСписокДоменов ()  
	Результат = Новый Массив(); 
	objNameSpace = "";                   
	Попытка  objNameSpace = ПолучитьCOMОбъект("WinNT:");   
		м = Новый Массив();  м.Добавить("domain"); // Computer User Group GlobalGroup domain  
		м2 = Новый COMSafeArray(м, "VT_VARIANT");  
		objNameSpace.Filter = м2;  
		Для каждого item Из objNameSpace Цикл   
			Результат.Добавить(item.Name);  
		КонецЦикла; 
	Исключение  
		Результат.Очистить(); 
	КонецПопытки;  
	Возврат Результат;
КонецФункции

Функция ПолучитьСписокГруппВДомене (ИмяДомена, ТипГрупп = "GlobalGroup", ПодстрокаПоиска = "", ПодстрокаИсключения = "")
	Результат = Новый ТаблицаЗначений(); 
	Результат.Колонки.Добавить("Name",,"Name");
	Результат.Колонки.Добавить("distinguishedName",,"distinguishedName");	
	Попытка
		//Основной алгоритм
		КомандаАДО = Новый COMОбъект("ADODB.Command");
		СоединениеАДО = Новый COMОбъект("ADODB.Connection");
		СоединениеАДО.Provider = "ADsDSOObject";
		СоединениеАДО.Open("Active Directory Provider");
		КомандаАДО.ActiveConnection = СоединениеАДО;
		
		Попытка
			База = "<LDAP://" + Объект.Домен + ">";
		Исключение
			Сообщить("Не удалось подключиться к домену (IMG:style_emoticons/default/sad.gif) ");
		КонецПопытки;

		Реквизиты = "name, distinguishedName";
		ТекстЗапроса = База + ";" + Объект.ФильтрГруппы + ";" + Реквизиты + ";subtree";
		КомандаАДО.CommandText = ТекстЗапроса;
		КомандаАДО.Properties("Page Size").Value = 100;
		КомандаАДО.Properties("Timeout").Value = 30;
		КомандаАДО.Properties("Cache Results").Value = Ложь;
		ВыборкаАДО = КомандаАДО.Execute();
		Пока НЕ ВыборкаАДО.EOF Цикл
			//Сообщить(ВыборкаАДО.Fields("name").Value);
			//Сообщить(ВыборкаАДО.Fields("distinguishedName").Value);
			СтрГруппа = Результат.Добавить();
			СтрГруппа.name = СокрЛП(ВыборкаАДО.Fields("name").Value);
			СтрГруппа.distinguishedName = СокрЛП(ВыборкаАДО.Fields("distinguishedName").Value);
			ВыборкаАДО.MoveNext();
		КонецЦикла;
		
	Исключение
		Результат.Очистить();
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ИмяДомена = Константы.ИмяДомена.Получить();
	Если Не ЗначениеЗаполнено(Объект.ИмяДомена) Тогда
		СписокДоменов = ПолучитьСписокДоменов();
	    Объект.ИмяДомена = СписокДоменов[0];
	КонецЕсли;
	
	Объект.Домен = Константы.Домен.Получить();
	Если Не ЗначениеЗаполнено(Объект.Домен) Тогда
		RootDSE = ПолучитьCOMОбъект("LDAP://RootDSE");
		Объект.Домен = RootDSE.Get("defaultNamingContext");
	КонецЕсли;	
	
	Объект.ПрефиксГруппыДомена = Константы.ПрефиксГруппыДомена.Получить();
	Если Не ЗначениеЗаполнено(Объект.ПрефиксГруппыДомена) Тогда
		Объект.ПрефиксГруппыДомена = "DLO";
	КонецЕсли;
		
	Объект.Фильтр = Константы.ФильтрAD.Получить();
	Если Не ЗначениеЗаполнено(Объект.Фильтр) Тогда
		Объект.Фильтр = "(&(!(useraccountcontrol:1.2.840.113556.1.4.803:=2))(memberOf:1.2.840.113556.1.4.1941:=";
	КонецЕсли;	
	
	Объект.ФильтрГруппы = Константы.ФильтрГруппAD.Получить();
	Если Не ЗначениеЗаполнено(Объект.ФильтрГруппы) Тогда
		Объект.ФильтрГруппы = "(&(objectCategory=group)(name=dlo*))";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокДоменов = ПолучитьСписокДоменов();
	Элементы.ИмяДомена.СписокВыбора.ЗагрузитьЗначения(СписокДоменов);	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьГруппы(Команда)	
	ПолучитьГруппыНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ПолучитьГруппыНаСервере()
	
	СписокГруппВДомене = ПолучитьСписокГруппВДомене(Объект.ИмяДомена,,Объект.ПрефиксГруппыДомена);
	
	Для Каждого СтрГр Из СписокГруппВДомене Цикл
		СтрокаГруппДоступа = Объект.СписокГруппДоступа.Добавить();
		СтрокаГруппДоступа.ГруппаДоступа = СтрГр.Name;
		СтрокаГруппДоступа.ГруппаПолныйПуть = СтрГр.distinguishedName;
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПользователейДЛО(Команда)
	СоздатьПользователейДЛОСервер();
	Сообщить("Загрузка завершена");
КонецПроцедуры

&НаСервере
Процедура СоздатьПользователейДЛОСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.СоздатьПользователей();
	Если Не Объект.ЧастичнаяЗагрузка Тогда
		Об.ОтключитьПользователей();
	КонецЕсли;	
	ЗначениеВРеквизитФормы(Об, "Объект");	
КонецПроцедуры

&НаКлиенте
Процедура ЧастичнаяЗагрузкаПриИзменении(Элемент)
	Элементы.ПользователиAD.ТолькоПросмотр = НЕ Объект.ЧастичнаяЗагрузка;
КонецПроцедуры

