
Функция ПолучитьДоступностьРолей() Экспорт
	#Если Сервер Тогда
		ВозВрат Бор_ПовторноеИспользованиеСервер.ПолучитьДоступностьРолей();
	#Иначе
		ВозВрат Бор_ПовторноеИспользованиеКлиент.ПолучитьДоступностьРолей();
	#КонецЕсли
КонецФункции

Функция ПолучитьРольДоступна(Знач ИмяРоли) Экспорт
	#Если Сервер Тогда
		Если ТипЗнч(ИмяРоли) = Тип("ОбъектМетаданных") Тогда
			ИмяРоли = ИмяРоли.Имя;
		КонецЕсли;
	#КонецЕсли
	ВозВрат Бор_ПовторноеИспользованиеКлиентСервер.ПолучитьДоступностьРолей()[ИмяРоли];
КонецФункции

// БоР : Процедура вычисления значения, которое стоит вычислить всего один раз за сеанс (например, что-то из метаданных) 03.05.2016 20:03:34
Функция ВычислитьВыражение(Выражение) Экспорт
	ВозВрат Вычислить(Выражение);
КонецФункции

// БоР :  13.07.2017 16:56:15
Функция ПолучитьШагСеткиРасписания() Экспорт
	ВозВрат 5; // минут
КонецФункции

// БоР : Возвращает время и сдвиг в секундах от начала дня по значеням НачалоРабочегоДня, КонецРабочегоДня 19.07.2017 12:28:56
Функция ПолучитьРабочееВремяДня() Экспорт
	 ВозВрат Бор_ПовторноеИспользованиеСервер.ПолучитьРабочееВремяДня();
КонецФункции
