#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора Тогда	
		Элементы.Список.РежимВыбора                    =    Истина;		
        Заголовок                                      = НСтр("ru = 'Выбор проекта'");
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",ТекущаяДата());
	
	УстановитьВидимостьДоступность();
	УстановитьВидимостьДоступностьПоПравам();
	
КонецПроцедуры

&НаКлиенте
Процедура ВАрхивеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПомеченныеНаУдалениеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура УстановитьВидимостьДоступность()
	Если ВАрхиве Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ВАрхиве"); 
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВАрхиве", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	Если ПомеченныеНаУдаление Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПометкаУдаления");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕСли;
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьЭлементЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ЭтаФорма.ОбновитьОтображениеДанных();	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьДоступностьПоПравам()
	ПолныеПрава = РольДоступна("ПолныеПрава");
	Экономист = РольДоступна("Экономист");
	Элементы.ВАрхиве.Доступность              = ПолныеПрава Или Экономист;
	Элементы.ПомеченныеНаУдаление.Доступность = ПолныеПрава;
КонецПроцедуры	

#КонецОбласти

#Область КОМАНДЫ_НА_ФОРМЕ

&НаКлиенте
Процедура СоздатьURMExchange(Команда)
	Если URMExchangeСервер.ПолучитьКонстантуСозданиеПроектовИзУРВ() Тогда
		ОткрытьФорму("Справочник.Проекты.ФормаОбъекта",,,,,,Новый ОписаниеОповещения("СоздатьЭлементЗавершение", ЭтаФорма));
	ИначеЕсли URMExchangeСервер.ПолучитьКонстантуОбменСОБД()Тогда
		ИмяОперации = "GetProject";
		Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ОткрытьФорму("Обработка.СозданиеОбъектовURMExchange.Форма.Форма",Новый Структура("ИмяОперации", ИмяОперации),,,,,,Режим);
	Иначе
		ОткрытьФорму("Справочник.Проекты.ФормаОбъекта",,,,,,Новый ОписаниеОповещения("СоздатьЭлементЗавершение", ЭтаФорма));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти