
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("Сотрудник") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДатаНачалаПроекта", ТекущаяДатаСеанса(), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДатаОкончанияПроекта", ТекущаяДатаСеанса(), ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзMSProject(Команда)
	ВыбранныйПроект = Неопределено;
	Попытка
		ВыбранныйПроект = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].ПравоеЗначение;
	Исключение
	КонецПопытки;
	ПараметрыФормы = Новый Структура("Проект", ВыбранныйПроект);
	ОткрытьФорму("Обработка.ЗагрузкаЗадач.Форма.ФормаMSProject", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	ПараметрыФормы = Новый Структура("СозданаВручную", Истина);
	Форма =  ПолучитьФорму("Справочник.Задачи.Форма.ФормаЭлементаРучная", ПараметрыФормы);
	Форма.Открыть();
КонецПроцедуры

