
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	ЭтоГруппа = Ложь;
	Задача = ПолучитьРасшифровкуНаСервере(Расшифровка, ЭтоГруппа);
	
	Если Задача <>  Неопределено Тогда 
		Если ЭтоГруппа Тогда 
			Возврат; 
		КонецЕсли; //Группа стандартной обработкой проверяется на равенство, поэтому при выборе группы используем стандартную расшифровку.
	    СтандартнаяОбработка = Ложь;

		КоллекцияЗдесь = ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	    НастройкиЗдесь = ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки;
		
	    //Получаем Период, указанный в настройках текущего отчета:
	    ИДНастройкиПериодЗдесь = НастройкиЗдесь.ПараметрыДанных.Элементы.Найти("Период").ИдентификаторПользовательскойНастройки;
	    НачалоПериодаЗдесь = КоллекцияЗдесь.Найти(ИДНастройкиПериодЗдесь).Значение.ДатаНачала;
	    КонецПериодаЗдесь = КоллекцияЗдесь.Найти(ИДНастройкиПериодЗдесь).Значение.ДатаОкончания;

	    //"Классическая" схема расшифровки одного отчета используя другой отчет:
	    //Настраиваем отбор будующего отчета
	    ОтборХ = Новый Структура("Задача, Период",
	                            Задача,
	                            Новый СтандартныйПериод(НачалоПериодаЗдесь,КонецПериодаЗдесь));
	    
	    //В параметрах должен фигурировать вариант, в котором НЕТ установки параметров пользовательских настроек и пользовательских отборов,
	    //т.к. это вызовет конфликт настроек и отчет не будет сформирован.
	    ПараметрыФормыХ = Новый Структура("СформироватьПриОткрытии, Отбор, КлючВарианта", Истина, ОтборХ, "ДляРасшифровки");

	    ОткрытьФорму("Отчет.ПланФактПоВыполненнымРаботамРасшифровка.Форма", ПараметрыФормыХ, ЭтаФорма, Задача);
		Возврат;
	КонецЕсли;
	
	ЭтоГруппа = Ложь;
	Сотрудник = ПолучитьРасшифровкуНаСервереПоСотруднику(Расшифровка, ЭтоГруппа);
	
	Если Сотрудник <>  Неопределено Тогда 
		Если ЭтоГруппа Тогда 
			Возврат; 
		КонецЕсли; //Группа стандартной обработкой проверяется на равенство, поэтому при выборе группы используем стандартную расшифровку.
	    СтандартнаяОбработка = Ложь;

		КоллекцияЗдесь = ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	    НастройкиЗдесь = ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки;
		
	    //Получаем Период, указанный в настройках текущего отчета:
	    ИДНастройкиПериодЗдесь = НастройкиЗдесь.ПараметрыДанных.Элементы.Найти("Период").ИдентификаторПользовательскойНастройки;
	    НачалоПериодаЗдесь = КоллекцияЗдесь.Найти(ИДНастройкиПериодЗдесь).Значение.ДатаНачала;
	    КонецПериодаЗдесь = КоллекцияЗдесь.Найти(ИДНастройкиПериодЗдесь).Значение.ДатаОкончания;

	    //"Классическая" схема расшифровки одного отчета используя другой отчет:
	    //Настраиваем отбор будующего отчета
	    ОтборХ = Новый Структура("Сотрудник, Период",
	                            Сотрудник,
	                            Новый СтандартныйПериод(НачалоПериодаЗдесь,КонецПериодаЗдесь));
	    
	    //В параметрах должен фигурировать вариант, в котором НЕТ установки параметров пользовательских настроек и пользовательских отборов,
	    //т.к. это вызовет конфликт настроек и отчет не будет сформирован.
	    ПараметрыФормыХ = Новый Структура("СформироватьПриОткрытии, Отбор, КлючВарианта", Истина, ОтборХ, "ДляРасшифровкиСотрудник");

	    ОткрытьФорму("Отчет.ПланФактПоВыполненнымРаботамРасшифровка.Форма", ПараметрыФормыХ, ЭтаФорма, Сотрудник);
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере   
Функция ПолучитьРасшифровкуНаСервере(Расшифровка, ЭтоГруппа = Ложь)

	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки); 

	Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля(); 

	ПолеЗадача = Поля.Найти("Задача");

	Если ПолеЗадача = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		ЭтоГруппа = ПолеЗадача.Значение.ЭтоГруппа;
		
		Возврат ПолеЗадача.Значение;
	КонецЕсли;

КонецФункции


&НаСервере   
Функция ПолучитьРасшифровкуНаСервереПоСотруднику(Расшифровка, ЭтоГруппа = Ложь)

	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки); 

	Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля(); 

	ПолеСотрудник = Поля.Найти("Сотрудник");

	Если ПолеСотрудник = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		ЭтоГруппа = Ложь;
		Возврат ПолеСотрудник.Значение;
	КонецЕсли;

КонецФункции