#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
    БазаЗнаний.ПередЗаписью(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
    БазаЗнаний.ПриЗаписи(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
    БазаЗнаний.ПриКопированииПриЗаполнении(ЭтотОбъект);
    
    Состояние = Перечисления.СостоянияОшибок.Запланирована;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
    БазаЗнаний.ПриКопированииПриЗаполнении(ЭтотОбъект);

	Состояние = Перечисления.СостоянияОшибок.Запланирована;
	Комментарии.Очистить();
	
    ПоляОписаний = СтрРазделить("Описание, Воспроизведение, ОбходнойПуть, Решение", ", ", Ложь);
    Для каждого Поле Из ПоляОписаний Цикл
        ЭтотОбъект[Поле + "Хранилище"] = Новый ХранилищеЗначения(ОбъектКопирования[Поле + "Хранилище"].Получить(), Новый СжатиеДанных(9));
    	ЭтотОбъект[Поле + "АвторИзменения"] = Неопределено;
    	ЭтотОбъект[Поле + "ДатаИзменения"] = Неопределено;
    КонецЦикла; 
    
    ВнешнийНомер = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
