#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
    
    Документ = ТекстХранилище.Получить();
    Если Документ <> Неопределено Тогда
        Текст = Документ.ПолучитьТекст();
    КонецЕсли; 
    
    Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВитринСервисов") Тогда
        Если Не ЗначениеЗаполнено(Сервис) Тогда
            Сервис = БазаЗнанийПовтИсп.СервисВитрины(Витрина);
        КонецЕсли; 
    Иначе
        Если Не ЗначениеЗаполнено(Витрина) Тогда
            Витрина = БазаЗнанийПовтИсп.ОсновнаяВитринаСервиса(Сервис);
        КонецЕсли; 
    КонецЕсли; 
    
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
    
    ТекстХранилище = Новый ХранилищеЗначения(ОбъектКопирования.ТекстХранилище.Получить(), Новый СжатиеДанных(9));
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
