#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	Если ИменаПараметровСеанса = Неопределено Тогда
		// Раздел установки параметров сеанса при начале сеанса (ИменаПараметровСеанса = Неопределено)
		// Выполняется установка параметров сеанса, которые можно инициализировать 
		// при начале работы системы
		
	Иначе
		// Установка параметров сеанса "по требованию"
		
		// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
		// следует инициализировать сразу группой. Для того, чтобы избежать их повторной инициализации,
		// имена уже установленных параметров сеанса сохраняются в массиве УстановленныеПараметры
		УстановленныеПараметры = Новый Массив;
		Для каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
				
	КонецЕсли;
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	//{Рарус kruser 10.06.2019 87760
	Если УРВСервер.ПроверитьДоступностьРолиКлиентКомпании() Тогда		
		
		НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
		
		СоставФорм = Новый СоставФормНачальнойСтраницы;
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.СамообслуживаниеПартнеров.Форма.Форма");
		
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",, НастройкиНачальнойСтраницы);
		
	КонецЕсли;	
	//}Рарус kruser 10.06.2019 87760
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

// Установить значения параметров сеанса и возвратить имена установленных параметров сеанса
// в параметре УстановленныеПараметры.
//
// Параметры
//  ИмяПараметра  - Строка - имя параметра сеанса, который требуется установить (проинициализировать).
//  УстановленныеПараметры  - Массив - массив, в который добавляются имена
//                                     установленных (проинициализированных) параметров.
//
Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)
	
	Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Пользователи
   // Если ИмяПараметра = "ТекущийПользователь" Тогда
   //    Пользователи.ОпределитьТекущегоПользователя(ИмяПараметра, УстановленныеПараметры);
   //КонецЕсли; //Котова: текущий пользователь определяется
   Если ИмяПараметра = "ТекущееПодразделение" Тогда
	    Пользователи.ОпределитьТекущееПодразделение(ИмяПараметра, УстановленныеПараметры);
	КонецЕсли; 
	// Конец Пользователи
	
    Если ИмяПараметра = "РазрешенныеПодразделения" Тогда
	    Пользователи.ОпределитьПодразделенияВИерархии(УстановленныеПараметры);
	КонецЕсли;	

КонецПроцедуры
