#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
    
    БазаЗнаний.ПередЗаписью(ЭтотОбъект);
	
	Если Состояние = Перечисления.СостоянияКонсультаций.Актуальна Тогда
		Актуальна = Истина;
	Иначе
		Актуальна = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
    БазаЗнаний.ПриЗаписи(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
    БазаЗнаний.ПриКопированииПриЗаполнении(ЭтотОбъект);
    
    Актуальна = Истина;
	Состояние = Перечисления.СостоянияКонсультаций.Актуальна;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
    БазаЗнаний.ПриКопированииПриЗаполнении(ЭтотОбъект);
    
	Актуальна = Истина;
	Состояние = Перечисления.СостоянияКонсультаций.Актуальна;
	
	Комментарии.Очистить();
	
	ОписаниеХранилище = Новый ХранилищеЗначения(ОбъектКопирования.ОписаниеХранилище.Получить(), Новый СжатиеДанных(9));
	ОписаниеАвторИзменения = Неопределено;
	ОписаниеДатаИзменения = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
