#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область СлужебныеПроцедурыИФункции

Процедура НастроитьМакетСхемыКомпоновки()

    // Если соглашения не используются, поле КоличествоСНарушениемСрока нужно скрыть
    Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСоглашения") Тогда
        ПолеКоличествоСНарушениемСрока = Новый ПолеКомпоновкиДанных("КоличествоСНарушениемСрока");
        ПоляОграничений = СтрРазделить("Поле, Группировка, Порядок, Условие", ", ", Ложь);
        Для каждого ПолеНабора Из СхемаКомпоновкиДанных.НаборыДанных.Основной.Поля Цикл
            Если ПолеНабора.Поле = "КоличествоСНарушениемСрока" Тогда
                Для Каждого Ограничение Из ПоляОграничений Цикл
                     ПолеНабора.ОграничениеИспользования[Ограничение] = Истина;
                     ПолеНабора.ОграничениеИспользованияРеквизитов[Ограничение] = Истина;
                КонецЦикла; 	
            КонецЕсли;
        КонецЦикла;
       	ВариантНастроек = СхемаКомпоновкиДанных.ВариантыНастроек.ВремяОбработкиЗакрытыхОбращений;
        Для НомерПоля = -(ВариантНастроек.Настройки.Выбор.Элементы.Количество() - 1) По 0 Цикл
            ПолеВыбора = ВариантНастроек.Настройки.Выбор.Элементы[-НомерПоля];
            Если ПолеВыбора.Поле = ПолеКоличествоСНарушениемСрока Тогда
                ВариантНастроек.Настройки.Выбор.Элементы.Удалить(ПолеВыбора);
            КонецЕсли;
        КонецЦикла;
    КонецЕсли; 
    
КонецПроцедуры
    
НастроитьМакетСхемыКомпоновки();

#КонецОбласти

#КонецЕсли
