
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

// Возвращает пользователей абонента
//
Функция ПользователиАбонента(Абонент) Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = 
    	"ВЫБРАТЬ
        |	ПользователиАбонентов.ПользовательСервиса
        |ИЗ
        |	РегистрСведений.ПользователиАбонентов КАК ПользователиАбонентов
        |ГДЕ
        |	ПользователиАбонентов.Абонент = &Абонент";
    
    Запрос.УстановитьПараметр("Абонент", Абонент);
    
    Результат = Запрос.Выполнить();
    Если Результат.Пустой() Тогда
    	Возврат Новый Массив
    Иначе
        Возврат Результат.Выгрузить().ВыгрузитьКолонку("ПользовательСервиса");
    КонецЕсли; 
	
КонецФункции

#КонецОбласти

#КонецЕсли 