#Область ПОЛУЧЕНИЕ_ДАННЫХ_ИЗ_ОБД
Функция ЗагрузкаДанныхИзURM(ИмяОперации, CUIDКонтрагента = Неопределено, ИНН = Неопределено) Экспорт
	
	Попытка
		//Если  ИмяОперации = "GetProject" Тогда
		//	Интеграция = Перечисления.Интеграции.ПолучениеДанныхИзЗУП;
		//ИначеЕсли ИмяОперации = "GetEmployee" Или ИмяОперации = "GetPartner" Тогда
		Интеграция = Перечисления.Интеграции.ПолучениеДанныхИзОБД;
		//Иначе
		//	Сообщить("Операция не опознана, обратитесь к администратору!");
		//КонецЕсли;
		Подключение = УстановитьПодключениеКВебСервису(Интеграция);
		Если Подключение = Неопределено Тогда
			СообщитьПользователю("Подключение не установлено: не удалось получить настройки. Обратитесь к администратору.");
			Возврат Неопределено;
		КонецЕсли;	
	Исключение
		СообщитьПользователю("Подключение не установлено. Обратитесь к администратору.");
		Возврат Неопределено
	КонецПопытки;
	
	Если ИмяОперации = "GetProject" Тогда
		ОбъектXDTO = Подключение.GetProject();
		СписокXDTO = ОбъектXDTO.TablePr;
	ИначеЕсли ИмяОперации = "GetPartner" Или ИмяОперации = "GetPartnerA" Тогда
		ОбъектXDTO = Подключение.GetPartner(?(CUIDКонтрагента = Неопределено, "", CUIDКонтрагента),?(ИНН = Неопределено, "", ИНН));
		СписокXDTO = ОбъектXDTO.TablePar;
	ИначеЕсли ИмяОперации = "GetEmployee" Тогда
		ОбъектXDTO = Подключение.GetEmployee();
		СписокXDTO = ОбъектXDTO.TableEmp;
	Иначе
		СообщитьПользователю("Подключение не установлено. Не задано значение метода.");
		Возврат Неопределено
	КонецЕсли;	
	
	Возврат СписокXDTO
		                                                        
КонецФункции

Функция УстановитьПодключениеКВебСервису(Интеграция)
	НастройкиИнтеграции = УРВСервер.ПолучитьНастройкиИнтеграции(Интеграция);
	
	Если НастройкиИнтеграции = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Порт = НастройкиИнтеграции.АдресПодключения;
	//Порт = Константы.ОБД_Порт.Получить();
	//Порт = ?(ЗначениеЗаполнено(ПортКонстанта),ПортКонстанта,"http://shangtsung/rarus_copy/ws/OBDExchange?wsdl");
	
	Пользователь = НастройкиИнтеграции.Пользователь;
	//Пользователь = Константы.ОБД_Пользователь.Получить();
	//Пользователь = ?(ЗначениеЗаполнено(ПользовательКонстанта),ПользовательКонстанта,"wedServerUser");
	
	Пароль = НастройкиИнтеграции.Пароль;
	//Пароль = Константы.ОБД_Пароль.Получить();
	//Пароль = ?(ЗначениеЗаполнено(ПарольКонстанта),ПарольКонстанта,"1");
	
	Определение = Новый WSОпределения(Порт, Пользователь, Пароль);
		
	Прокси = Новый WSПрокси(Определение, URMExchangeСервер.ПолучитьПространствоИмен(), "OBDExchange",  Определение.Сервисы[0].ТочкиПодключения[0].Имя);
	Прокси.Пользователь = Пользователь;
	Прокси.Пароль = Пароль;
		
	Возврат Прокси;
	
КонецФункции // УстановитьПодключениеКВебСервису()
#КонецОбласти

#Область СООБЩЕНИЯ_ПОЛЬЗОВАТЕЛЮ
Процедура СообщитьПользователю(ТекстСообщения)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
КонецПроцедуры
#КонецОбласти













