
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		ЗадачаУтверждения = Неопределено;
		  Если Параметры.Свойство("Ключ", ЗадачаУтверждения) Тогда
			Если ЗначениеЗаполнено(ЗадачаУтверждения) И ЗначениеЗаполнено(ЗадачаУтверждения.БизнесПроцесс) Тогда
				Если Ложь Тогда
					ЗадачаУтверждения = Задачи.ЗадачиПоУтверждениюВнеплановыхОтсутствий.ПустаяСсылка();
				КонецЕсли;
				
				
				ДанныеФормыДляОткрытия = БизнесПроцессы.УтверждениеВнеплановыхОтсутствий.ПолучитьДанныеФормыДляОткрытия(ЗадачаУтверждения);
				Если ЗначениеЗаполнено(ДанныеФормыДляОткрытия.ИмяФормы) Тогда
					СтандартнаяОбработка = Ложь;
					ВыбраннаяФорма = ДанныеФормыДляОткрытия.ИмяФормы;
					Для каждого Параметр Из ДанныеФормыДляОткрытия.ПараметрыФормы Цикл
						Параметры.Вставить(Параметр.Ключ, Параметр.Значение);
					КонецЦикла;
				Иначе
					СтандартнаяОбработка = Ложь;
					ВыбраннаяФорма = "Задачи.ЗадачиУтвержденияВнеплановыхОтсутствий.Форма.ФормаЗадачи";
				КонецЕсли;
			КонецЕсли;
		  КонецЕсли;
	КонецЕсли;

	    
КонецПроцедуры
