
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	//СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	Если РольДоступна("РуководительПодразделения") И Не РольДоступна("ПолныеПрава") Тогда			
		НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("РуководительПодразделения",Истина);
	КонецЕсли;
	
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПодразделениеРук", ПараметрыСеанса.ТекущееПодразделение);
	
КонецПроцедуры
