

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипОбъекта = Неопределено;
	
	Если Параметры.Свойство("МассивПроектов") Тогда
		Для Каждого ЗначениеПроект Из Параметры.МассивПроектов Цикл
			СписокПроектов.Добавить(ЗначениеПроект.Ссылка);
		КонецЦикла;
		ЭтаФорма.Заголовок = "Выбор возможных проектов";
		ТипОбъекта = "Проект";
	КонецЕсли;
	
	Если Параметры.Свойство("МассивКонтрагентов") Тогда
		Для Каждого ЗначениеКонтрагент Из Параметры.МассивКонтрагентов Цикл
			СписокКонтрагентов.Добавить(ЗначениеКонтрагент.Ссылка);
		КонецЦикла;
		ЭтаФорма.Заголовок = "Выбор возможных контрагентов";
		ТипОбъекта = "Контрагент";
	КонецЕсли;
	
	Если Параметры.Свойство("МассивАбонентов") Тогда
		Для Каждого ЗначениеАбонент Из Параметры.МассивАбонентов Цикл
			СписокАбонентов.Добавить(ЗначениеАбонент.Ссылка);
		КонецЦикла;
		ЭтаФорма.Заголовок = "Выбор возможных абонентов";
		ТипОбъекта = "Абонент";
	КонецЕсли;
	
	Если Параметры.Свойство("МассивПользователей") Тогда
		Для Каждого ЗначениеПользователь Из Параметры.МассивПользователей Цикл
			СписокПользователей.Добавить(ЗначениеПользователь.Ссылка);
		КонецЦикла;
		ЭтаФорма.Заголовок = "Выбор возможных пользователей";
		ТипОбъекта = "Пользователь";
	КонецЕсли;
	
	УстановитьВидимостьДоступностьНаСервере(ТипОбъекта);
	
КонецПроцедуры

#Область Обработчики_Команд_На_Форме

&НаКлиенте
Процедура ВыбратьКонтрагента(Команда)
	ТекДанные = Элементы.СписокКонтрагентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Сообщить("Не удалось открыть объект");
		Возврат
	КонецЕсли;	
	ЗакрытьФормуОбъекта(ТекДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПользователя(Команда)
	ТекДанные = Элементы.СписокПользователей.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Сообщить("Не удалось открыть объект");
		Возврат
	КонецЕсли;	
	ЗакрытьФормуОбъекта(ТекДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроект(Команда)
	ТекДанные = Элементы.СписокПроектов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Сообщить("Не удалось открыть объект");
		Возврат
	КонецЕсли;
	ЗакрытьФормуОбъекта(ТекДанные.Значение); 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйПроект(Команда)
	ЗакрытьФормуОбъекта(ПолучитьПустуюСсылкуНаОбъект("Проект"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовогоКонтрагента(Команда)
	ЗакрытьФормуОбъекта(ПолучитьПустуюСсылкуНаОбъект("Контрагент"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовогоПользователя(Команда)
	ЗакрытьФормуОбъекта(ПолучитьПустуюСсылкуНаОбъект("Пользователь"));
КонецПроцедуры

#КонецОбласти

#Область Служебная

&НаКлиенте
Процедура ЗакрытьФормуОбъекта(Ссылка)
	ЭтаФорма.Закрыть(Новый Структура("ВыбранныйОбъект",Ссылка));
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьНаСервере(ТипОбъекта)
	Элементы.СписокКонтрагентов.Видимость  	= ?(ТипОбъекта = "Контрагент"   , Истина , Ложь);
	Элементы.СписокПользователей.Видимость 	= ?(ТипОбъекта = "Пользователь" , Истина , Ложь);
	Элементы.СписокПроектов.Видимость      	= ?(ТипОбъекта = "Проект"       , Истина , Ложь);
	Элементы.СписокАбонентов.Видимость  	= ?(ТипОбъекта = "Абонент"   	, Истина , Ложь);
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьПустуюСсылкуНаОбъект(ТипОбъекта)
	Если ТипОбъекта = "Проект" Тогда
		Возврат Справочники.Проекты.ПустаяСсылка()
	ИначеЕСли ТипОбъекта = "Пользователь" Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка()
	ИначеЕсли ТипОбъекта = "Контрагент" Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка()
	ИначеЕсли ТипОбъекта = "Абонент" Тогда
		Возврат Справочники.Абоненты.ПустаяСсылка()
	Иначе
		Возврат Неопределено
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ВыбратьАбонента(Команда)
	ТекДанные = Элементы.СписокАбонентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Сообщить("Не удалось открыть объект");
		Возврат
	КонецЕсли;	
	ЗакрытьФормуОбъекта(ТекДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовогоАбонента(Команда)
	ЗакрытьФормуОбъекта(ПолучитьПустуюСсылкуНаОбъект("Абонент"));
КонецПроцедуры

#КонецОбласти

