#Область КОМАНДЫ_ФОРМЫ
&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ТекущаяСтрокаДанных = Элементы.Сотрудники.ТекущиеДанные;
	ЗаполнитьСтрокуВТаблицуСотрудников(ТекущаяСтрокаДанных);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	МассивДанных = Новый Массив;
	Для Каждого СтрокаДанныхСотрудника из ТаблицаСотрудников Цикл
		СтруктураДанных = Новый Структура("Сотрудник, Подразделение, Должность, Регион, Ставка");
		ЗаполнитьЗначенияСвойств(СтруктураДанных,СтрокаДанныхСотрудника);
		МассивДанных.Добавить(СтруктураДанных);
	КонецЦикла;
	ЭтаФорма.Закрыть(Новый Структура("МассивДанных",МассивДанных));
КонецПроцедуры
#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ
&НаСервере
Процедура ЗаполнитьСтрокуВТаблицуСотрудников(СтрокаДанных)
	СтрокаТаблицаСотрудники = ТаблицаСотрудников.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТаблицаСотрудники,СтрокаДанных)
КонецПроцедуры	

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ
&НаКлиенте
Процедура ПодразделениеПриАктивизацииСтроки(Элемент)
	ТекущаяСтрокаПодразделения = Элементы.Подразделение.ТекущиеДанные;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Сотрудники, "Подразделение", ТекущаяСтрокаПодразделения.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры
#КонецОбласти






