
&НаСервере
Функция ПолучитьЯчейку(ТабДок, НомерСткроки, НомерКолонки)
	Возврат ТабДок.Область("R" + Формат(НомерСткроки, "ЧН=; ЧГ=") + "C" + Формат(НомерКолонки, "ЧН=; ЧГ=")).Текст;
КонецФункции

&НаСервере
Функция КомандаЗагрузитьЗадачиНаСервере()
	
	НачатьТранзакцию();

	НомерСтроки = 1;

	Попытка
		Пока Истина Цикл
			НомерСтроки = НомерСтроки + 1;
			
			ЗадачаНаименование = ПолучитьЯчейку(ТабДок, НомерСтроки, 1);
			Если ПустаяСтрока(ЗадачаНаименование) Тогда
				Прервать;
			КонецЕсли;

			ЗадачаОписание = ПолучитьЯчейку(ТабДок, НомерСтроки, 2);
			ЗадачаОценка = ПолучитьЯчейку(ТабДок, НомерСтроки, 3);
			
			//запишем текущие данные
			СоздатьЗаписьВЗадачи(ЗадачаНаименование, ЗадачаОписание, ЗадачаОценка);
		КонецЦикла;
	Исключение
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	Возврат НомерСтроки - 2;
	
КонецФункции

&НаКлиенте
Процедура КомандаЗагрузитьЗадачи(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	КоличествоЗадач = КомандаЗагрузитьЗадачиНаСервере();	
	
	Если КоличествоЗадач = Неопределено ИЛИ КоличествоЗадач < 1 Тогда
		Предупреждение("Загрузка не выполнена!");
	Иначе
		Предупреждение("Загружено задач: " + КоличествоЗадач);
		ОповеститьОбИзменении(Тип("СправочникСсылка.Задачи"));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьВЗадачи(ЗадачаНаименование, ЗадачаОписание, ЗадачаОценка)
	
	//Сообщить("" + ЗадачаНаименование + Символы.Таб + ЗадачаОписание + Символы.Таб + ЗадачаОценка);
	//Возврат;
	
	НоваяЗадача = Справочники.Задачи.СоздатьЭлемент();
	НоваяЗадача.Владелец = Объект.Проект;

	НоваяЗадача.Наименование = ЗадачаНаименование;
	НоваяЗадача.Формулировка = ЗадачаОписание;
	НоваяЗадача.Трудозатраты = ЗадачаОценка;
	НоваяЗадача.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
	
	ТабДок.Вывести(Макет);

КонецПроцедуры
