#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Разделы") Тогда
		
		РеквизитыРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Сервисы, Компоненты");
	
		Родитель = ДанныеЗаполнения;
		
		Если РеквизитыРодителя.Сервисы <> Неопределено Тогда
			ВыборкаСервисы = РеквизитыРодителя.Сервисы.Выбрать();
			Пока ВыборкаСервисы.Следующий() Цикл
				НоваяСтрока = Сервисы.Добавить();
				НоваяСтрока.Сервис = ВыборкаСервисы.Сервис;
			КонецЦикла;
		КонецЕсли;  
		
		Если РеквизитыРодителя.Компоненты <> Неопределено Тогда
			ВыборкаКомпоненты = РеквизитыРодителя.Компоненты.Выбрать();
			Пока ВыборкаКомпоненты.Следующий() Цикл
				НоваяСтрока = Компоненты.Добавить();
				НоваяСтрока.Компонент = ВыборкаКомпоненты.Компонент;
			КонецЦикла;  
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
	//astyul, 77590, 12.12.2018
	Если Не ЗначениеЗаполнено(Родитель) И Не (Пользователи.ЭтоПолноправныйПользователь() ИЛИ РольДоступна("УСПРасширеннаяДобавлениеИзменение")) Тогда
	//astyul, 77590, 12.12.2018
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Разделы верхнего уровня заполняются только Администратором.'");
		Сообщение.Сообщить(); 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
