
#Область ПрограммныйИнтерфейс
    
// Получает параметры Автообновление и ПериодАвтообновления списка из настроек
// 
// Параметры:
// Форма - форма или имя формы
// ИмяСписка - Строка - имя элемента формы
// 
// Возвращает структуру:
// - Автообновление (Булево)
// - ПериодАвтоОбновления (Число)
//
Функция ПолучитьНастройкиАвтообновленияФормы(Форма) Экспорт
	
	Результат = Новый Структура("Автообновление, ПериодАвтоОбновления", Истина, 60);
	
	Если ТипЗнч(Форма) = Тип("Строка") Тогда
		КлючОбъекта = Форма + ".Автообновление";
	Иначе
		КлючОбъекта = Форма.ИмяФормы + ".Автообновление";
	КонецЕсли;
	
	КлючНастройки = Строка(ПолучитьСкоростьКлиентскогоСоединения());
	Настройки = ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючНастройки);
	Если ЗначениеЗаполнено(Настройки) Тогда
		Результат.Автообновление = Настройки.Автообновление;
		Результат.ПериодАвтоОбновления = Настройки.ПериодАвтоОбновления;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 
