

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.СписокДвижения.ИзменятьСоставСтрок = Ложь;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Обращение") Тогда
		Обращение = Параметры.Отбор.Обращение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Обращение) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru='Движения'"); 
		Элементы.Обращение.Видимость = Ложь;
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокИсторияСостояний, "Обращение", Обращение);
        Элементы.СписокИсторияСостоянийОбращение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Если ЗначениеЗаполнено(Обращение) Тогда
		ПровестиОбращение(Обращение, Истина);
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПровестиОбращение(Обращение, КорректировкаДвижений = Ложь)
	
	Если ЗначениеЗаполнено(Обращение) Тогда
		ОбращениеОбъект = Обращение.ПолучитьОбъект();
        ОбращениеОбъект.ДополнительныеСвойства.Вставить("КорректировкаДвижений", КорректировкаДвижений);
		ОбращениеОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
