
#Область ПрограммныйИнтерфейс

// Убирает разделители в номере телефона.
//
// Параметры:
//    НомерТелефона - Строка - номер телефона или факса.
//
// Возвращаемое значение:
//     Строка - номер телефона или факса без разделителей.
//
Функция УбратьРазделителиВНомерТелефона(Знач НомерТелефона) Экспорт
	
	Поз = СтрНайти(НомерТелефона, ",");
	Если Поз <> 0 Тогда
		НомерТелефона = Лев(НомерТелефона, Поз-1);
	КонецЕсли;
	
	НомерТелефона = СтрЗаменить(НомерТелефона, "-", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, " ", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "+", "");
	
	Возврат НомерТелефона;
	
КонецФункции

// Устанавливает доступ к реквизиту контактной информации.
//
Процедура УстановитьДоступКРеквизитуКИ(ЭлементФормы, СтрокаТабличнойЧастиКИ) Экспорт
	
	КИТолькоПросмотр = Новый Массив;
	КИТолькоПросмотр.Добавить(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресАбонента);
	КИТолькоПросмотр.Добавить(Справочники.ВидыКонтактнойИнформации.СайтАбонента);
	КИТолькоПросмотр.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонАбонента);
	КИТолькоПросмотр.Добавить(Справочники.ВидыКонтактнойИнформации.EmailАбонента);
	КИТолькоПросмотр.Добавить(Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияАбонента);
	КИТолькоПросмотр.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонПользователяСервиса);
	КИТолькоПросмотр.Добавить(Справочники.ВидыКонтактнойИнформации.EmailПользователяСервиса);
	
	Если КИТолькоПросмотр.Найти(СтрокаТабличнойЧастиКИ.Вид) <> Неопределено И Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		ЭлементФормы.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 
