
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Установить исключительную управляемую блокировку на массив переданных консультаций.
//
// Параметры:
//   Объекты - Массив - массив ссылок на консультации, или одна ссылка СправочникСсылка.Консультация.
//
Процедура ЗаблокироватьОбъекты(Объекты) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	
	Если ТипЗнч(Объекты) = Тип("Массив") Тогда
		Для каждого Консультация Из Объекты Цикл
			
			Если ТипЗнч(Объекты) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда 
				Продолжить;
			КонецЕсли;
			
			ЭлементБлокировки = Блокировка.Добавить("Справочник.Консультации");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Консультация);
		КонецЦикла;
	Иначе	
		Если ТипЗнч(Объекты) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Возврат;
		КонецЕсли;	
		ЭлементБлокировки = Блокировка.Добавить("Справочник.Консультации");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Объекты);
	КонецЕсли;
	
	Блокировка.Заблокировать();
	
КонецПроцедуры

// Возвращает форматированное описание консультации.
//
// Параметры:
//  Ссылка - СправочникСсылка.Консультации - консультация, по которой нужно получить описание.
// 
// Возвращаемое значение:
//  ФорматированныйДокумент - описание консультации.
//
Функция ФорматированноеОписание(Ссылка) Экспорт
    
    РеквизитыКарточки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Наименование, ОписаниеХранилище");
			
    Возврат РеквизитыКарточки.ОписаниеХранилище.Получить();
    
КонецФункции

// Возвращает вид события создания объекта.
//
Функция ВидСобытия_Создание() Экспорт
	
    Возврат Справочники.ВидыБизнесСобытий.СозданиеКонсультации;	
	
КонецФункции

// Возвращает вид события изменения объекта.
//
Функция ВидСобытия_Изменение() Экспорт
	
    Возврат Справочники.ВидыБизнесСобытий.ИзменениеКонсультации;	
	
КонецФункции

// Возвращает вид события перенаправления объекта.
//
Функция ВидСобытия_Перенаправление() Экспорт
	
    Возврат Справочники.ВидыБизнесСобытий.ПеренаправлениеКонсультации;	
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Проверяет, подходит ли объект к шаблону бизнес-процесса
//
Функция ШаблонПодходитДляАвтозапускаБизнесПроцессаПоОбъекту(ШаблонСсылка, ПредметСсылка, Подписчик, ВидСобытия, Условие) Экспорт
	
	Возврат БизнесСобытия.ШаблонПодходитДляАвтозапускаБизнесПроцессаПоКарточке(ШаблонСсылка, 
		ПредметСсылка, Подписчик, ВидСобытия, Условие);
	
КонецФункции

#КонецОбласти

#КонецЕсли