	
&НаКлиенте
Процедура ОК(Команда)
	
	ВыбраннаяСтрока = Элементы.СписокДокументов.ТекущаяСтрока;
	Если ВыбраннаяСтрока = Неопределено Тогда
		ВозВрат;
	КонецЕсли;
	ОбработатьВыборСтроки(ВыбраннаяСтрока)
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработатьВыборСтроки(ВыбраннаяСтрока)
	Если Не ПроверитьЗаполнение() Тогда
		ВозВрат;
	КонецЕсли;
	СтруктураВозВрата = Новый Структура;
	СтруктураВозВрата.Вставить("Событие"				, ВыбраннаяСтрока);
	Закрыть(СтруктураВозВрата);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументы()
	
	НастроитьСписокДокументов();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокДокументов()
	
	ТекущаяДата = ТекущаяДата();
	
	ДР = Бор_ПовторноеИспользованиеКлиентСервер.ПолучитьДоступностьРолей();
	ДоступностьПодчиненныхПодразделенийЛК	= Истина;
	ДоступностьСвоегоПодразделенияЛК		= Истина;
	ДоступностьВсегоДляПП					= БоР_ОбщийМодульКлиентСервер.ВБулево(БоР_ОбщийМодуль.ПолучитьНастройку("ЛК_ПолнымПравамДоступныВсеСотрудники"));
	
	#Область Отбор_по_Сотруднику_ФизЛица
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//
	//#Область Запрос
	//"ВЫБРАТЬ
	//|	Пользователи.ФизЛицо КАК ФизЛицо,
	//|	Пользователи.Ссылка КАК Сотрудник
	//|ИЗ
	//|	Справочник.Пользователи КАК Пользователи
	//|ГДЕ
	//|	&УсловиеПоСотруднику
	//|	И НЕ Пользователи.ПометкаУдаления
	//|	И НЕ Пользователи.ЭтоГруппа";
	//#КонецОбласти
	//
	//Момент = Неопределено;
	//
	//Если ЗначениеЗаполнено(Сотрудник) Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСотруднику", "Пользователи.Ссылка = &Сотрудник");
	//	Запрос.УстановитьПараметр("Сотрудник"			, Сотрудник);
	//ИначеЕсли ДР.ПолныеПрава И ДоступностьВсегоДляПП Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСотруднику", "ИСТИНА");
	//Иначе // все доступные
	//	// возможно, надо заменить "В" на соединения с ВТ, но при малом объеме списка - и так неплохо
	//	МассивСотрудников = РегистрыСведений.РолиСотрудниковЛК.ПолучитьМассивДоступныхСотрудников(ДоступностьПодчиненныхПодразделенийЛК, ДоступностьСвоегоПодразделенияЛК);
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСотруднику", "Ссылка В (&МассивСотрудников)");
	//	Запрос.УстановитьПараметр("МассивСотрудников"	, МассивСотрудников);
	//КонецЕсли;
	//
	//РезультатыЗапроса = Запрос.ВыполнитьПакет();
	//РезультатЗапроса = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1];
	//СписокСотрудников = Новый СписокЗначений;
	//СписокСотрудников.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ФизЛицо"));
	//БоР_ОбщийМодульКлиентСервер.УстановитьОтборПоПолю(СписокДокументов.Отбор, "Ответственный", СписокСотрудников, Истина, , ВидСравненияКомпоновкиДанных.ВСписке);
	#КонецОбласти
	
	#Область Отбор_по_Сотруднику_Пользователи
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		БоР_ОбщийМодульКлиентСервер.УстановитьОтборПоПолю(СписокДокументов.Отбор, "Исполнитель", Сотрудник, Истина, , ВидСравненияКомпоновкиДанных.Равно);
	ИначеЕсли ДР.ПолныеПрава И ДоступностьВсегоДляПП Тогда
		БоР_ОбщийМодульКлиентСервер.УстановитьОтборПоПолю(СписокДокументов.Отбор, "Исполнитель", Неопределено, Истина, , ВидСравненияКомпоновкиДанных.Равно);
	Иначе // все доступные
		// возможно, надо заменить "В" на соединения с ВТ, но при малом объеме списка - и так неплохо
		МассивСотрудников = РегистрыСведений.РолиСотрудниковЛК.ПолучитьМассивДоступныхСотрудников(ДоступностьПодчиненныхПодразделенийЛК, ДоступностьСвоегоПодразделенияЛК);
		СписокСотрудников = Новый СписокЗначений;
		СписокСотрудников.ЗагрузитьЗначения(МассивСотрудников);
		БоР_ОбщийМодульКлиентСервер.УстановитьОтборПоПолю(СписокДокументов.Отбор, "Исполнитель", СписокСотрудников, Истина, , ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	#КонецОбласти
	
	//
	//МассивСостояний = Новый Массив;
	//МассивСостояний.Добавить(Перечисления.франСостоянияЗаданий.ВРаботе);
	//МассивСостояний.Добавить(Перечисления.франСостоянияЗаданий.Выдано);
	//МассивСостояний.Добавить(Перечисления.франСостоянияЗаданий.Запланировано);
	//МассивСостояний.Добавить(Перечисления.франСостоянияЗаданий.Передано);
	//СписокСостояний = Новый СписокЗначений;
	//СписокСостояний.ЗагрузитьЗначения(МассивСостояний);// какая-то тупость
	//БоР_ОбщийМодульКлиентСервер.УстановитьОтборПоПолю(СписокДокументов.Отбор, "Состояние", СписокСостояний, Истина, , ВидСравненияКомпоновкиДанных.ВСписке);
	
	БоР_ОбщийМодульКлиентСервер.УстановитьОтборПоПолю(СписокДокументов.Отбор, "Дата", НачалоДня(Дата), Истина, "Отбор по дате от", ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	БоР_ОбщийМодульКлиентСервер.УстановитьОтборПоПолю(СписокДокументов.Отбор, "Дата", ?(Не ЗначениеЗаполнено(Дата), '00010101', КонецДня(Дата)), Истина, "Отбор по дате до", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	БоР_ОбщийМодульКлиентСервер.УстановитьОтборПоПолю(СписокДокументов.Отбор, "Проект"			, Проект			, Истина);
	БоР_ОбщийМодульКлиентСервер.УстановитьОтборПоПолю(СписокДокументов.Отбор, "Абонент"		, Контрагент		, Истина);
	БоР_ОбщийМодульКлиентСервер.УстановитьОтборПоПолю(СписокДокументов.Отбор, "Инициатор"	, КонтактноеЛицо	, Истина);
	БоР_ОбщийМодульКлиентСервер.УстановитьОтборПоПолю(СписокДокументов.Отбор, "Проведен"		, Истина			, Истина);
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БоР_ОбщийМодуль.ЗаполнитьРеквизитыИзПараметров(ЭтаФорма, Неопределено);
	ОбновитьДокументы();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборСтроки(Элементы.ТаблицаДокументов.ДанныеСтроки(ВыбраннаяСтрока));
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ОбновитьДокументы();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьДокументы();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОбновитьДокументы();
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоПриИзменении(Элемент)
	ОбновитьДокументы();
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьДокументы();
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не ПроверитьЗаполнение() Тогда
		ВозВрат;
	КонецЕсли;
	ОбработатьВыборСтроки(ВыбраннаяСтрока);
КонецПроцедуры
