
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ДобавитьДвижение(Движения, Дата, Пожелание, Пользователь, Голос) Экспорт
	
 	Движения.ГолосаПользователейЗаПожелания.Записывать = Истина;
	НовоеДвижение = Движения.ГолосаПользователейЗаПожелания.Добавить();
	НовоеДвижение.Дата = Дата;
	НовоеДвижение.Пожелание = Пожелание;
	НовоеДвижение.Пользователь = Пользователь;
	НовоеДвижение.Голос = Голос;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
 