#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
    
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
	// Формирует код версии из наименования в формате А.Б.В.Г в виде числа в формате АААБББВВВДДДДДД.
	Код = ОбщегоНазначенияУСП.ВерсиюВЧисло(Наименование); 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Попытка
		ОбщегоНазначенияУСП.ВерсиюВЧисло(Наименование);
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ИнформацияОбОшибке().Описание;
		Сообщение.Поле = "Код";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Код"));
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли

