
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Сервис") И ЗначениеЗаполнено(Параметры.Сервис) Тогда
		
		Если Объект.Сервисы.НайтиСтроки(Новый Структура("Сервис", Параметры.Сервис)).Количество() = 0 Тогда
			
			НоваяСтрока = Объект.Сервисы.Добавить();
			НоваяСтрока.Сервис = Параметры.Сервис;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	УстановитьПараметрыВыбораКомпонентов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСервисы

&НаКлиенте
Процедура СервисыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПриИзмененииСервиса();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииСервиса()
	
	СервисыВладельцы = Новый Массив;
	Для каждого Строка Из Объект.Сервисы Цикл
		СервисыВладельцы.Добавить(Строка.Сервис);
	КонецЦикла; 
	
	ПараметрыДляВыбора = Новый Массив();
	ПараметрыДляВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", СервисыВладельцы));
	Элементы.КомпонентыКомпонент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыДляВыбора);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораКомпонентов()
	
	СервисыВладельцы = Новый Массив;
	Для каждого Строка Из Объект.Сервисы Цикл
		СервисыВладельцы.Добавить(Строка.Сервис);
	КонецЦикла; 
	
	ПараметрыДляВыбора = Новый Массив();
	ПараметрыДляВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", СервисыВладельцы));
	Элементы.КомпонентыКомпонент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыДляВыбора);
	
КонецПроцедуры

#КонецОбласти 
