#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	
	НастройкиОтчета = МодульВариантыОтчетов.ОписаниеОтчета(Настройки, Создать().Метаданные());
	НастройкиОтчета.Описание = НСтр("ru = 'Анализ обращений по сервисам разделам и компонентам, 
										  |обслуживающим организациям и линиям поддержки'");
	НастройкиОтчета.ОпределитьНастройкиФормы = Ложь;
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализОбращений");
	НастройкиВарианта.Описание = НСтр("ru = 'Анализ обращений по сервисам разделам и компонентам,
											|обслуживающим организациям и линиям поддержки.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ОбращенияНаОжидании");
	НастройкиВарианта.Описание = НСтр("ru = 'Сколько времени прошло с момента последнего исходящего письма 
											|в сторону пользователя до настоящего момента.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ТекущиеИсполнителиПоОткрытымОбращениям");
	НастройкиВарианта.Описание = НСтр("ru = 'Кто является текущим исполнителем по обращению 
											|и сколько времени с ним работает.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РаспределениеОбращенийПоКарточкамБазыЗнаний");
	НастройкиВарианта.Описание = НСтр("ru = 'Какие специалисты линий поддержки наполняют карточки базы знаний.'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли