
#Область ТипыИнцидентов

Функция ТипИнцидента_ОшибкаОтправкиЭлектроннойПочты() Экспорт
	Возврат "УправлениеСлужбойПоддержки.ОшибкаОтправкиЭлектроннойПочты";
КонецФункции

Функция ТипИнцидента_ОшибкаПолученияЭлектроннойПочты() Экспорт
	Возврат "УправлениеСлужбойПоддержки.ОшибкаПолученияЭлектроннойПочты";
КонецФункции

Функция ТипИнцидента_ОшибкаОбменаДанными() Экспорт
	Возврат "УправлениеСлужбойПоддержки.ОшибкаОбменаДанными";
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СписокТиповИнцидентовМенеджерСервиса(СписокТипов) Экспорт
	
	Описание = ИнцидентыЦККСервер.СоздатьОписаниеТипаИнцидента(ТипИнцидента_ОшибкаОтправкиЭлектроннойПочты());
	Описание.УровеньИнцидента = "Ошибка";
	Описание.Подсистема = "Обслуживание";
	Описание.КонтекстИнформационнойБазы = Истина;
	Описание.Теги.ПрикладнаяОшибка = Истина;
	ИнцидентыЦККСервер.СоздатьЗаписьТипа(СписокТипов, Описание);
	
	Описание = ИнцидентыЦККСервер.СоздатьОписаниеТипаИнцидента(ТипИнцидента_ОшибкаПолученияЭлектроннойПочты());
	Описание.УровеньИнцидента = "Ошибка";
	Описание.Подсистема = "Обслуживание";
	Описание.КонтекстИнформационнойБазы = Истина;
	Описание.Теги.ПрикладнаяОшибка = Истина;
	ИнцидентыЦККСервер.СоздатьЗаписьТипа(СписокТипов, Описание);
	
	Описание = ИнцидентыЦККСервер.СоздатьОписаниеТипаИнцидента(ТипИнцидента_ОшибкаОбменаДанными());
	Описание.УровеньИнцидента = "Ошибка";
	Описание.Подсистема = "ОбменДанными";
	Описание.КонтекстИнформационнойБазы = Истина;
	Описание.Теги.ПрикладнаяОшибка = Истина;
	ИнцидентыЦККСервер.СоздатьЗаписьТипа(СписокТипов, Описание);
		
КонецПроцедуры

Процедура ВыполнитьЗадачиМониторингаЦКК() Экспорт
		
КонецПроцедуры

#КонецОбласти
