
#Область ОбработчикиСобытийФормы
    
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьОписаниеКонтекста();
	ОбменДаннымиСервер.ФормаНастройкиУзловПриСозданииНаСервере(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбменДаннымиКлиент.ФормаНастройкиПередЗакрытием(Отказ, ЭтаФорма, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоказатьПредупреждение(, НСтр("ru='Дополнительная настройка не требуется.'"));
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
    
&НаСервере
Процедура ПолучитьОписаниеКонтекста()
	
	ОписаниеКонтекста = НСтр("ru='Синхронизируются данные по:
                        	 |	- Абонентам
                        	 |	- Пользователям сервиса
                        	 |	- Приложениям
                             |  - Подпискам на тарифы
                        	 |	- Взаимосвязи абонентов и пользователей
                        	 |	- Взаимосвязи пользователей и приложений
                             |	
                             |Дополнительная настройка узлов не требуется.'");
	
КонецПроцедуры

#КонецОбласти 
