

//==================================================================================================
#Область СобытияФормы
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ТекущийПользователь	= ПользователиКлиентСервер.ТекущийПользователь();
	//	ДоступноСотруднику	= РегистрыСведений.РолиСотрудниковЛК.ПолучитьДоступныеДействия(ТекущийПользователь);
	//	Если ДоступноСотруднику.СамоПланирование Тогда
	//		Объект.Сотрудник	= ТекущийПользователь;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


//==================================================================================================
#Область СобытияЭлементовФормы
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПодобратьИзРасписания(Команда)
	
	ДатаРасписания = НачалоДня(Объект.ДатаВремяНачала);
	Если Не ЗначениеЗаполнено(ДатаРасписания) Тогда
		ДатаРасписания = НачалоДня(Объект.Дата);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаРасписания) Тогда
		ДатаРасписания = НачалоДня(ТекущаяДата());
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Дата"				, ДатаРасписания);
	ПараметрыФормы.Вставить("Сотрудник"			, Объект.Сотрудник);
	ПараметрыФормы.Вставить("ДатаАктуальности"	, Объект.Дата);
	ПараметрыФормы.Вставить("ДокументСсылка"	, Объект.Ссылка);
	
	//ОписаниеОповещения = Новый ОписаниеОповещения("ПодобратьИзРасписанияЗавершение", ЭтаФорма);
	//ОткрытьФорму("Документ.ЗаписьНаЛК.Форма.ФормаПодбораРасписания", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ДополнительныеПараметры = Новый Структура;
	ИмяФормыДляОткрытия = "Документ.ЗаписьНаЛК.Форма.ФормаПодбораРасписания";
	БоР_ОбщийМодульКлиент.ОткрытьБлокирующуюФорму(ЭтаФорма, ИмяФормыДляОткрытия, ПараметрыФормы, "ПодобратьИзРасписанияЗавершение", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИзРасписанияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураВозВрата = Результат;
	Если ТипЗнч(СтруктураВозВрата) <> Тип("Структура") Тогда
		ВозВрат;
	КонецЕсли;
	
	Объект.Сотрудник		= СтруктураВозВрата.Сотрудник;
	Объект.ДатаВремяНачала	= СтруктураВозВрата.ДатаВремяНачала;

КонецПроцедуры

#КонецОбласти


//==================================================================================================
#Область СобытияИмяТабличнойЧасти
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ


#КонецОбласти


//==================================================================================================
#Область СобытияОбщегоНазначения
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


#КонецОбласти


//==================================================================================================


