
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Основание = Новый Структура("Основание,Команда", ПараметрКоманды, "Ответить");
	ПараметрыОткрытия = Новый Структура("Основание", Основание);
	
	//Лобашова 79898 25.01.2019 +
	ПредметОбращение = ПараметрыВыполненияКоманды.Источник.Предмет;
	СтрокаТема = ПараметрыВыполненияКоманды.Источник.Объект.Тема;
	Тема = ПараметрТемаПоОбращению(ПредметОбращение, СтрокаТема);
	Если Тема <> Неопределено Тогда
		ПараметрыОткрытия.Вставить("Тема", Тема);
	КонецЕсли;
	//Лобашова 79898 25.01.2019 -
	
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыОткрытия);
	ПараметрыВыполненияКоманды.Источник.Закрыть();
	
КонецПроцедуры

#КонецОбласти

//Лобашова 79898 25.01.2019 +
&НаСервере
Функция ПараметрТемаПоОбращению(ПредметОбращение, СтрокаТема)
	ИспользоватьСтандартнуюГенерациюТем = Константы.ИспользоватьСтандартнуюГенерациюТем.получить();
	Если ИспользоватьСтандартнуюГенерациюТем = Ложь Тогда
		
	    Тема = "%1 [КлючОбращения]";
	    ВзаимодействияУСП.ЗаменитьПараметрыНаЗначения(Тема, ПредметОбращение);
		
		//проверяем наличие номера в обращении 
		Номер = ПрефиксацияОбъектов.УдалитьЛидирующиеНулиИзНомераОбъекта(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредметОбращение,"Номер"));
		Значение = ВзаимодействияУСП.НачалоКлючаОбращения() + СокрП(Номер) ;
		Если СтрНайти(СтрокаТема,Значение) = 0 Тогда 
			Возврат СтрШаблон(Тема, СтрокаТема);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции
//Лобашова 79898 25.01.2019 -