Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрогнозПроектаПоказатели.Период КАК ПериодПланирования,
	|	&Проект КАК Проект,
	|	&ПериодПрогноза КАК ПериодПрогноза,
	|	ПрогнозПроектаПоказатели.Ссылка.ЭтапПроекта КАК ЭтапПроекта,
	|	ПрогнозПроектаПоказатели.Статья КАК Статья,
	|	ПрогнозПроектаПоказатели.Подразделение КАК Подразделение,
	|	ПрогнозПроектаПоказатели.Сотрудник КАК Сотрудник,
	|	ПрогнозПроектаПоказатели.КонтрагентАбонент КАК КонтрагентАбонент,
	|	ПрогнозПроектаПоказатели.Время КАК Время,
	|	ПрогнозПроектаПоказатели.Сумма КАК Сумма,
	|	""ПланированиеПроектов_Прогноз"" КАК ИмяРегистра_,
	|	&Сценарий КАК Сценарий,
	|	&Период КАК Период
		//Лобашова 30.05.2019  87156 +
	 |	,
	 |	ПрогнозПроектаПоказатели.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
	 |	ПрогнозПроектаПоказатели.Квалификация КАК Квалификация
	 //Лобашова 30.05.2019  87156 -
	|ИЗ
	|	Документ.ПрогнозПроекта.Показатели КАК ПрогнозПроектаПоказатели
	|ГДЕ
	|	ПрогнозПроектаПоказатели.Ссылка = &Ссылка";
	 Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	 Запрос.УстановитьПараметр("Период",ДокументСсылка.Дата);
	 Запрос.УстановитьПараметр("Проект",ДокументСсылка.Проект);
	 Запрос.УстановитьПараметр("ПериодПрогноза",ДокументСсылка.ПериодПрогноза);
	 Запрос.УстановитьПараметр("Сценарий",ДокументСсылка.Сценарий);
	 
	 ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
     ТаблицыДляДвижений.Вставить("ТаблицаПланированиеПроектов_Прогноз"			, Запрос.Выполнить().Выгрузить());
КонецПроцедуры	
 
Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПрогнозПроекта.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПрогнозПроекта.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПрогнозПроекта.СоздатьДокумент();
	КонецЕсли;
КонецПроцедуры
