
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВитринСервисов") Тогда
        ТекущийОбъект.Сервис = БазаЗнанийПовтИсп.СервисВитрины(ТекущийОбъект.Витрина);
    Иначе
        ТекущийОбъект.Витрина = БазаЗнанийПовтИсп.ОсновнаяВитринаСервиса(ТекущийОбъект.Сервис);
    КонецЕсли; 
    
КонецПроцедуры

// {Рарус_shav 2018.10.23 74401
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элемент 			= ЭтаФорма.Элементы.Добавить("УчетнаяЗапись", Тип("ПолеФормы"), ЭтаФорма);
    Элемент.Вид 		= ВидПоляФормы.ПолеВвода;
    Элемент.Заголовок 	= "Учетная запись";
    Элемент.ПутьКДанным = "Запись.УчетнаяЗапись";
	ЭтаФорма.Элементы.Переместить(Элемент, ЭтаФорма, ЭтаФорма.Элементы.Витрина);
	
	Элемент 			= ЭтаФорма.Элементы.Добавить("Проект", Тип("ПолеФормы"), ЭтаФорма);
    Элемент.Вид 		= ВидПоляФормы.ПолеВвода;
    Элемент.Заголовок 	= "Проект";
    Элемент.ПутьКДанным = "Запись.Проект";
	ЭтаФорма.Элементы.Переместить(Элемент, ЭтаФорма, ЭтаФорма.Элементы.Витрина);
	
КонецПроцедуры // }Рарус_shav 2018.10.23 74401
