
#Область ПрограммныйИнтерфейс

// Возвращает основную витрину сервиса.
//
// Параметры:
//  Сервис - СправочникСсылка.Сервисы - сервис, для которого нужно вернуть основную витрину.
//
Функция ОсновнаяВитринаСервиса(Сервис) Экспорт
    
    Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сервис, "ОсновнаяВитрина");
	
КонецФункции

// Возвращает сервис по витрине.
//
// Параметры:
//  Витрина - СправочникСсылка.Витрины - витрина, для которй нужно вернуть сервис.
//
Функция СервисВитрины(Витрина) Экспорт
	
    Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Витрина, "Владелец");
	
КонецФункции

#КонецОбласти
 
