Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрочиеЗатратыЗатраты.ЭтапПроекта,
	|	ПрочиеЗатратыЗатраты.Статья КАК Статья,
	|	ПрочиеЗатратыЗатраты.Сотрудник КАК Сотрудник,
	|	ПрочиеЗатратыЗатраты.Часы КАК Часы,
	|	ПрочиеЗатратыЗатраты.Сумма КАК Сумма,
	|	ПрочиеЗатратыЗатраты.Ссылка,
	|	ПрочиеЗатратыЗатраты.Ссылка.ТипЗатрат
	|ПОМЕСТИТЬ втДокумент
	|ИЗ
	|	Документ.ПрочиеЗатраты.Затраты КАК ПрочиеЗатратыЗатраты
	|ГДЕ
	|	ПрочиеЗатратыЗатраты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеЗатратыЗатратыПоДням.ЭтапПроекта,
	|	ПрочиеЗатратыЗатратыПоДням.Статья КАК Статья,
	|	ПрочиеЗатратыЗатратыПоДням.Сотрудник КАК Сотрудник,
	|	ПрочиеЗатратыЗатратыПоДням.Часы КАК Часы,
	|	ПрочиеЗатратыЗатратыПоДням.Ссылка,
	|	ПрочиеЗатратыЗатратыПоДням.Ссылка.ТипЗатрат,
	|	ПрочиеЗатратыЗатратыПоДням.Дата,
	|	ПрочиеЗатратыЗатратыПоДням.Работа,
	|	ПрочиеЗатратыЗатратыПоДням.Задача,
	|	ПрочиеЗатратыЗатратыПоДням.ИдентификаторСтроки,
	|	ПрочиеЗатратыЗатратыПоДням.ВидРабочегоВремени
	|ПОМЕСТИТЬ втДокументПоЧасам
	|ИЗ
	|	Документ.ПрочиеЗатраты.ЗатратыПоДням КАК ПрочиеЗатратыЗатратыПоДням
	|ГДЕ
	|	ПрочиеЗатратыЗатратыПоДням.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КадроваяИсторияСрезПоследних.Период) КАК Период,
	|	КадроваяИсторияСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ вт_МаксПоКадровым
	|ИЗ
	|	РегистрСведений.КадроваяИстория.СрезПоследних(&Период, &УчаствуетСотрудник) КАК КадроваяИсторияСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	КадроваяИсторияСрезПоследних.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_МаксПоКадровым.Сотрудник КАК Сотрудник,
	|	КадроваяИстория.Подразделение КАК ПодразделениеСотрудника
	|ПОМЕСТИТЬ ВТ_КадровыеДанные
	|ИЗ
	|	вт_МаксПоКадровым КАК вт_МаксПоКадровым
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИстория КАК КадроваяИстория
	|		ПО вт_МаксПоКадровым.Период = КадроваяИстория.Период
	|			И вт_МаксПоКадровым.Сотрудник = КадроваяИстория.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ОтработанноеВремя"" КАК ИмяРегистра_,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	втДокументПоЧасам.Ссылка.Проект КАК Проект,
	|	втДокументПоЧасам.ЭтапПроекта,
	|	втДокументПоЧасам.Ссылка.Месяц КАК Месяц,
	|	втДокументПоЧасам.Сотрудник КАК Сотрудник,
	|	&Период КАК Период,
	|	втДокументПоЧасам.Часы КАК Часы,
	|	втДокументПоЧасам.Дата,
	|	втДокументПоЧасам.Работа,
	|	втДокументПоЧасам.Задача,
	|	втДокументПоЧасам.ИдентификаторСтроки,
	|	втДокументПоЧасам.ВидРабочегоВремени
	|ИЗ
	|	втДокументПоЧасам КАК втДокументПоЧасам
	|ГДЕ
	|	втДокументПоЧасам.ТипЗатрат = ЗНАЧЕНИЕ(Перечисление.ТипПрочихЗатрат.Оклад)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ПланированиеПроектов_Факт"" КАК ИмяРегистра_,
	|	втДокумент.Ссылка.Проект КАК Проект,
	|	втДокумент.ЭтапПроекта,
	|	втДокумент.Ссылка.Месяц КАК ПериодПланирования,
	|	втДокумент.Статья КАК Статья,
	|	втДокумент.Ссылка.Проект.Подразделение КАК Подразделение,
	|	втДокумент.Сотрудник КАК Сотрудник,
	|	&Период КАК Период,
	|	втДокумент.Часы КАК Время,
	|	втДокумент.Сумма КАК Сумма,
	|	ВТ_КадровыеДанные.ПодразделениеСотрудника
	|ИЗ
	|	втДокумент КАК втДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КадровыеДанные КАК ВТ_КадровыеДанные
	|		ПО втДокумент.Сотрудник = ВТ_КадровыеДанные.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Запрос.УстановитьПараметр("Период",ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("УчаствуетСотрудник",ДокументСсылка.ТипЗатрат <> Перечисления.ТипПрочихЗатрат.ПрочиеЗатраты);
	 
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаОтработанноеВремя"			, Результат[Результат.Количество() - 2].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаПланированиеПроектов_Факт"	, Результат[Результат.Количество() - 1].Выгрузить());
КонецПроцедуры	
 
Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПрочиеЗатраты.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПрочиеЗатраты.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПрочиеЗатраты.СоздатьДокумент();
	КонецЕсли;
КонецПроцедуры
