
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Попытка
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	ЗначениеПериод = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	
	ДатаНачала    = НачалоГОда(ТекущаяДата());
	ДатаОкончания = КонецГода(ТекущаяДата());
	
	Если ТипЗнч(ЗначениеПериод.Значение) = Тип("СтандартныйПериод") Тогда
		ДатаНачала = ЗначениеПериод.Значение.ДатаНачала;
		ДатаОкончания = ЗначениеПериод.Значение.ДатаОкончания; 
	КонецЕсли;
	
	ЗначениеВыводитьВсехСотруников = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("ВыводитьВсехСотрудников");
	Если НЕ ЗначениеВыводитьВсехСотруников.Использование Тогда
		ЗначениеВыводитьВсехСотруников.Значение     = Истина;
		ЗначениеВыводитьВсехСотруников.Использование = Истина;
	КонецЕсли;	
	
	// Параметры документа
	ДокументРезультат.ТолькоПросмотр = Истина;
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.Очистить();
	ДокументРезультат.АвтоМасштаб = Истина;
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	
	Если КлючВарианта = "ПоВидамРабот" Тогда
		Данные = Новый ТаблицаЗначений;
	Иначе	
		Данные = Новый ДеревоЗначений;
	КонецЕсли;	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, НастройкиОтчета,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	//Создадим и инициализируем процессор компоновки
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Данные);
	
	//Обозначим начало вывода
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	Макет = ПолучитьМакет("ПоСотрудникамПоДням");
	
	ОбластьШапка = Макет.ПолучитьОбласть("СтрокаШапка|СтрокаШапка1");
	ДокументРезультат.Вывести(ОбластьШапка);
	
	МассивМесяцев = ПолучитьМесяцыПоПериоду(ДатаНачала,ДатаОкончания);
	
	Для Каждого СтрокаДереваМесяц из МассивМесяцев Цикл
		ТекущийМесяц = Формат(СтрокаДереваМесяц,"ДФ=ММММ");
		ОбластьШапка = Макет.ПолучитьОбласть("СтрокаШапка|СтрокаШапка2");
		ОбластьШапка.Параметры.Месяц = ТекущийМесяц;
		ДокументРезультат.Присоединить(ОбластьШапка);
		
		ОбластьШапка = Макет.ПолучитьОбласть("СтрокаШапка|ОбластьИтог");
		ДокументРезультат.Присоединить(ОбластьШапка);
	КонецЦикла;
	
	ОбластьШапка1 = Макет.ПолучитьОбласть("СтрокаШапка3|СтрокаШапка1");
	ДокументРезультат.Вывести(ОбластьШапка1);
	
	Для Каждого СтрокаДереваМесяц из МассивМесяцев Цикл
		ОбластьШапка1 = Макет.ПолучитьОбласть("СтрокаШапка3|СтрокаШапка2");
		ОбластьШапка1.Параметры.ПериодДней = "16-" + Лев(КонецМесяца(СтрокаДереваМесяц),2);
		Если Лев(КонецМесяца(СтрокаДереваМесяц),2)= "30" Тогда
			ОбластьШапка1.Область("ДО").Узор = ТипУзораТабличногоДокумента.Узор1;
		ИначеЕсли Лев(КонецМесяца(СтрокаДереваМесяц),2)= "28" Тогда
			ОбластьШапка1.Область("ДО").Узор = ТипУзораТабличногоДокумента.Узор1;
			ОбластьШапка1.Область("ДД").Узор = ТипУзораТабличногоДокумента.Узор1;
			ОбластьШапка1.Область("ТД").Узор = ТипУзораТабличногоДокумента.Узор1;
		ИначеЕсли Лев(КонецМесяца(СтрокаДереваМесяц),2)= "29" Тогда
			ОбластьШапка1.Область("ТД").Узор = ТипУзораТабличногоДокумента.Узор1;
			ОбластьШапка1.Область("ДО").Узор = ТипУзораТабличногоДокумента.Узор1;
		КонецЕсли;	
		ДокументРезультат.Присоединить(ОбластьШапка1);
		
		ОбластьШапка1 = Макет.ПолучитьОбласть("СтрокаШапка3|ОбластьИтог");
		ДокументРезультат.Присоединить(ОбластьШапка1);
	КонецЦикла;
	
	Если КлючВарианта = "ПоВидамРабот" Тогда
		
		СтруктураГруппировки = НастройкиОтчета.Структура[0];
		
		МассивГруппировок = Новый Массив;
		
		Пока НЕ СтруктураГруппировки.Имя = "ДетальныеЗаписи" Цикл
			 МассивГруппировок.Добавить(СокрЛП(СтруктураГруппировки.ПоляГруппировки));
			 Попытка
				 СтруктураГруппировки = ПолучитьСледующуюГруппировку(СтруктураГруппировки);
			 Исключение
				 Прервать;
			 КонецПопытки;
		 КонецЦикла;	
		 
		 ГлубинаГруппировок = МассивГруппировок.Количество();
		
		Если ГлубинаГруппировок = 0 Тогда
			Возврат
		КонецЕсли;	
		
		ТаблицаГруппировка1 = Данные.Скопировать();
		ТаблицаГруппировка1.Свернуть(МассивГруппировок[0]);
		
		Для Каждого Группировка1 из ТаблицаГруппировка1 Цикл
			
			Если Не ЗначениеЗаполнено(Группировка1[МассивГруппировок[0]]) тогда
				Продолжить;
			КонецЕсли;	
			
			ИмяШапки = ПолучитьИмяГруппировки(МассивГруппировок[0]);
			
			ИмяШапкиИтог = ИмяШапки + "|СтрокаШапка1";
			ОбластьГруппировка1 = Макет.ПолучитьОбласть(ИмяШапкиИтог);
			ОбластьГруппировка1.Параметры[МассивГруппировок[0]] = Группировка1[МассивГруппировок[0]];
			ДокументРезультат.Вывести(ОбластьГруппировка1);
			
			ТаблицаДанныхГруппировка1 = СоздатьПустуюТаблицу();
			МассивДанныхГруппировка1  = Данные.НайтиСтроки(Новый Структура(МассивГруппировок[0],Группировка1[МассивГруппировок[0]]));
			
			Для Каждого СтрокаГруппировка1 из МассивДанныхГруппировка1 Цикл
				СтрокаДанныхГруппировка1 = ТаблицаДанныхГруппировка1.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДанныхГруппировка1,СтрокаГруппировка1);
			КонецЦикла;
			
			ТаблицаФактИтого = ТаблицаДанныхГруппировка1.Скопировать();
			ТаблицаФактИтого.Свернуть("Месяц,День","ЧасыИтого,ЧасыФакт");
			
			ИмяШапкиОсновнаяЧасть  = ИмяШапки + "|СтрокаШапка2";
			ИмяШапкиИтог2 = ИмяШапки + "|ОбластьИтог";
			
			Для Каждого Месяц из МассивМесяцев Цикл
				
				ОбластьФактИтог1 = Макет.ПолучитьОбласть(ИмяШапкиОсновнаяЧасть);
				ОбластьФактИтог2 = Макет.ПолучитьОбласть(ИмяШапкиИтог2);
				
				МассивДанных = ТаблицаФактИтого.НайтиСтроки(Новый Структура("Месяц",Месяц));
				ВывестиГруппировкуМесяца(Месяц,МассивДанных,ОбластьФактИтог1,ОбластьФактИтог2,ДокументРезультат,"ЧасыФакт");
				
			КонецЦикла;
			
			Если ГлубинаГруппировок > 1 Тогда
				
				Если ГлубинаГруппировок > 2 Тогда
					СтруктураГруппировки2 = Новый Структура("ИмяШапки1, Параметр",ПолучитьИмяГруппировки(МассивГруппировок[2]), МассивГруппировок[2]);
				Иначе
					СтруктураГруппировки2 = Неопределено;
				КонецЕсли;
				
				ИмяШапки2 = ПолучитьИмяГруппировки(МассивГруппировок[1]);
				ВывестиПодгруппу(МассивГруппировок[1],ИмяШапки2, МассивМесяцев, Данные.НайтиСтроки(Новый Структура(МассивГруппировок[0], Группировка1[МассивГруппировок[0]])),ДокументРезультат, Макет, СтруктураГруппировки2);
			КонецЕсли;	
			
		КонецЦикла;	
		
	Иначе
		
		Для Каждого СтрокаСотрудник из Данные.Строки Цикл
			ОбластьСотрудник = Макет.ПолучитьОбласть("СтрокаИтого|СтрокаШапка1");
			ОбластьСотрудник.Параметры.Сотрудник = СтрокаСотрудник.Сотрудник;
			ДокументРезультат.Вывести(ОбластьСотрудник);
			ТаблицаПоМесяцам = СоздатьПустуюТаблицу();
			Для Каждого СтрокаМесяц из СтрокаСотрудник.Строки Цикл
				СтрокаДанныхСотрудник = ТаблицаПоМесяцам.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДанныхСотрудник,СтрокаМесяц);
			КонецЦикла;
			ТаблицаФактИтого = ТаблицаПоМесяцам.Скопировать();
			ТаблицаФактИтого.Свернуть("Месяц,День,Выходной","ЧасыИтого,ЧасыФакт,ЧасыОтсутсвтия");
			Для Каждого Месяц из МассивМесяцев Цикл
				
				ОбластьФактИтог1 = Макет.ПолучитьОбласть("СтрокаИтого|СтрокаШапка2");
				ОбластьФактИтог2 = Макет.ПолучитьОбласть("СтрокаИтого|ОбластьИтог");
				
				МассивДанных = ТаблицаФактИтого.НайтиСтроки(Новый Структура("Месяц",Месяц));
				ВывестиГруппировкуМесяца(Месяц,МассивДанных,ОбластьФактИтог1,ОбластьФактИтог2,ДокументРезультат,"ЧасыФакт");
			КонецЦикла;	
			
			ОбластьСотрудник = Макет.ПолучитьОбласть("ОбластьОтсутствия|СтрокаШапка1");
			ДокументРезультат.Вывести(ОбластьСотрудник);
			
			Для Каждого Месяц из МассивМесяцев Цикл
				
				ОбластьОтсутИтог1 = Макет.ПолучитьОбласть("ОбластьОтсутствия|СтрокаШапка2");
				ОбластьОтсутИтог2 = Макет.ПолучитьОбласть("ОбластьОтсутствия|ОбластьИтог");
				
				МассивДанных = ТаблицаФактИтого.НайтиСтроки(Новый Структура("Месяц",Месяц));
				ВывестиГруппировкуМесяца(Месяц,МассивДанных,ОбластьОтсутИтог1,ОбластьОтсутИтог2,ДокументРезультат,"ЧасыОтсутсвтия");
			КонецЦикла;
			
			ОбластьСотрудник = Макет.ПолучитьОбласть("СтрокаПростой|СтрокаШапка1");
			ДокументРезультат.Вывести(ОбластьСотрудник);
			
			Для Каждого Месяц из МассивМесяцев Цикл
				
				ОбластьПростойИтог1 = Макет.ПолучитьОбласть("СтрокаПростой|СтрокаШапка2");
				ОбластьПростойИтог2 = Макет.ПолучитьОбласть("СтрокаПростой|ОбластьИтог");
				
				МассивДанных = ТаблицаФактИтого.НайтиСтроки(Новый Структура("Месяц",Месяц));
				ВывестиГруппировкуПростой(Месяц,МассивДанных,ОбластьПростойИтог1,ОбластьПростойИтог2,ДокументРезультат);
			КонецЦикла;
			
			
			ТаблицаПроектов = ТаблицаПоМесяцам.Скопировать();
			ТаблицаПроектов.Свернуть("Проект");
			
			ТаблицаФактПоПроекту = ТаблицаПоМесяцам.Скопировать();
			ТаблицаФактПоПроекту.Свернуть("Месяц,День,Проект","ЧасыФакт");
			
			ТаблицаРабот = ТаблицаПоМесяцам.Скопировать();
			ТаблицаРабот.Свернуть("Проект,Работа");		
			
			
			Для Каждого СтрокаПроект из ТаблицаПроектов Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаПроект.Проект) Тогда
					Продолжить;
				КонецЕсли;	
				
				ОбластьПроект = Макет.ПолучитьОбласть("СтрокаПроект|СтрокаШапка1");
				ОбластьПроект.Параметры.Заполнить(СтрокаПроект); 
				ДокументРезультат.Вывести(ОбластьПроект);
				
				
				Для Каждого Месяц из МассивМесяцев Цикл
					ОбластьПроектИтог1 = Макет.ПолучитьОбласть("СтрокаПроект|СтрокаШапка2");
					ОбластьПроектИтог2 = Макет.ПолучитьОбласть("СтрокаПроект|ОбластьИтог");
					МассивДанных = ТаблицаФактПоПроекту.НайтиСтроки(Новый Структура("Месяц,Проект",Месяц,СтрокаПроект.Проект));
					ВывестиГруппировкуМесяца(Месяц,МассивДанных,ОбластьПроектИтог1,ОбластьПроектИтог2,ДокументРезультат,"ЧасыФакт");
				КонецЦикла;
				
				Если КлючВарианта = "Основной" Тогда
					Для Каждого СтрокаРабота из ТаблицаРабот Цикл
						Если НЕ СтрокаРабота.Проект = СтрокаПроект.Проект Тогда
							Продолжить;
						КонецЕсли;
						ОбластьРабота = Макет.ПолучитьОбласть("СтрокаВидРаботы|СтрокаШапка1");
						
						ОбластьРабота.Параметры.ВидРаботы = СтрокаРабота.Работа;
						ДокументРезультат.Вывести(ОбластьРабота);
						
						Для Каждого Месяц из МассивМесяцев Цикл
							ОбластьРаботаИтог1 = Макет.ПолучитьОбласть("СтрокаВидРаботы|СтрокаШапка2");
							ОбластьРаботаИтог2 = Макет.ПолучитьОбласть("СтрокаВидРаботы|ОбластьИтог");
							
							МассивДанных = ТаблицаПоМесяцам.НайтиСтроки(Новый Структура("Месяц,Проект,Работа",Месяц,СтрокаПроект.Проект,СтрокаРабота.Работа));
							ВывестиГруппировкуМесяца(Месяц,МассивДанных,ОбластьРаботаИтог1,ОбластьРаботаИтог2,ДокументРезультат,"ЧасыФакт");
						КонецЦикла;	
					КонецЦикла;	
				КонецЕсли;
			КонецЦикла;
			
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	ДокументРезультат.ЗакончитьАвтогруппировкуКолонок();
	ДокументРезультат.ФиксацияСлева  = 1;
	ДокументРезультат.ФиксацияСверху = 2;
	
	Исключение
		Инфо = ИнформацияОбОшибке();
		ВызватьИсключение НСтр("ru = 'В настройку отчета внесены критичные изменения. Отчет не будет сформирован.'") + " " + Инфо.Описание;
	КонецПопытки;
	
	
	
	
КонецПроцедуры

Функция ПолучитьИмяГруппировки(ИмяГруппировки)
	Если ИмяГруппировки = "Работа" Тогда
		Возврат "СтрокаВидРаботы1"
	ИначеЕсли ИмяГруппировки = "Проект" Тогда
		Возврат "СтрокаПроект1"
	Иначе 
		Возврат "СтрокаИтого1"
	КонецЕсли;
КонецФункции	

Функция СоздатьПустуюТаблицу(СоздаватьСотрудник = Неопределено)
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Месяц",Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("День",Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("ЧасыОтсутсвтия",Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Простой",Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("ЧасыИтого",Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	ТаблицаДанных.Колонки.Добавить("ЧасыФакт",Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Работа",Новый ОписаниеТипов("СправочникСсылка.Работы"));
	ТаблицаДанных.Колонки.Добавить("Выходной",Новый ОписаниеТипов("Булево"));
	Если ТипЗнч(СоздаватьСотрудник) = Тип("Булево") Тогда
		ТаблицаДанных.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	КонецЕсли;	
	Возврат ТаблицаДанных
КонецФункции	

Функция ПолучитьМесяцыПоПериоду(ДатаНачала,ДатаОкончания)
	СписокДат = Новый Массив;
	Пока НачалоМесяца(ДатаНачала) <= НачалоМесяца(ДатаОкончания) Цикл
		СписокДат.Добавить(НачалоМесяца(ДатаНачала));
		ДатаНачала =  НачалоМесяца(ДобавитьМесяц(ДатаНачала, 1));
	КонецЦикла;
	Возврат СписокДат
КонецФункции	

Процедура ВывестиГруппировкуМесяца(Месяц,МассивДанных,ОбластьИтог1,ОбластьИтог2,ДокументРезультат,ИмяКолонки)
	Если МассивДанных.Количество() = 0 Тогда
		ДокументРезультат.Присоединить(ОбластьИтог1);
		ДокументРезультат.Присоединить(ОбластьИтог2);
	Иначе
		ЧасыПерваяЧасть = 0;
		ЧасыВтораяЧасть = 0;
		Для Каждого СтрокаДанных из МассивДанных Цикл
			ОбластьИтог1.Параметры["Итог" + СокрЛП(День(СтрокаДанных.День))] = СтрокаДанных[ИмяКолонки]; 
			Если День(СтрокаДанных.День) <=15 и День(СтрокаДанных.День)>=1 Тогда
				ЧасыПерваяЧасть = ЧасыПерваяЧасть + СтрокаДанных[ИмяКолонки];
			Иначе
				ЧасыВтораяЧасть = ЧасыВтораяЧасть + СтрокаДанных[ИмяКолонки];
			КонецЕсли;
		КонецЦикла;
		ОбластьИтог1.Параметры.ИтогПерваяЧасть = ЧасыПерваяЧасть;
		ОбластьИтог1.Параметры.ИтогВтораяЧасть = ЧасыВтораяЧасть;
		ДокументРезультат.Присоединить(ОбластьИтог1);
		ОбластьИтог2.Параметры.Итого = ЧасыПерваяЧасть + ЧасыВтораяЧасть;
		ДокументРезультат.Присоединить(ОбластьИтог2);
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ВывестиГруппировкуПростой(Месяц,МассивДанных,ОбластьИтог1,ОбластьИтог2,ДокументРезультат)
	Если МассивДанных.Количество() = 0 Тогда
		ДокументРезультат.Присоединить(ОбластьИтог1);
		ДокументРезультат.Присоединить(ОбластьИтог2);
	Иначе
		ЧасыПерваяЧасть = 0;
		ЧасыВтораяЧасть = 0;
		Для Каждого СтрокаДанных из МассивДанных Цикл
			Если СтрокаДанных.Выходной Тогда
				Продолжить;
			КонецЕсли;	
			Простой = 8 - СтрокаДанных.ЧасыОтсутсвтия - СтрокаДанных.ЧасыФакт;
			ОбластьИтог1.Параметры["Итог" + СокрЛП(День(СтрокаДанных.День))] = ?(Простой < 0 , "", Простой); 
			Если День(СтрокаДанных.День) <=15 и День(СтрокаДанных.День)>=1 Тогда
				ЧасыПерваяЧасть = ЧасыПерваяЧасть + ?(Простой < 0, 0,Простой);
			Иначе
				ЧасыВтораяЧасть = ЧасыВтораяЧасть + ?(Простой < 0, 0,Простой);
			КонецЕсли;				
		КонецЦикла;
		ОбластьИтог1.Параметры.ИтогПерваяЧасть = ?(ЧасыПерваяЧасть <0,"",ЧасыПерваяЧасть);
		ОбластьИтог1.Параметры.ИтогВтораяЧасть = ?(ЧасыВтораяЧасть <0, "", ЧасыВтораяЧасть);
		ДокументРезультат.Присоединить(ОбластьИтог1);
		Итог = ЧасыПерваяЧасть + ЧасыВтораяЧасть;
		ОбластьИтог2.Параметры.Итого = ?(Итог< 0 ,"",Итог);
		ДокументРезультат.Присоединить(ОбластьИтог2);
	КонецЕсли;	
КонецПроцедуры	

Процедура ВывестиПодгруппу(ИмяПараметра, ИмяШапки, МассивМесяцев, МассивДанных ,ДокументРезультат, Макет, СтруктураГруппировки2)
	
	ТаблицаГруппировка1 = СоздатьПустуюТаблицу(Истина);
	Для Каждого ЗначениеМассива из МассивДанных Цикл
		Группировка1 = ТаблицаГруппировка1.Добавить();
		ЗаполнитьЗначенияСвойств(Группировка1,ЗначениеМассива);
	КонецЦикла;	
	
	ТаблицаДанных = ТаблицаГруппировка1.Скопировать();
    ТаблицаДанных.Свернуть(ИмяПараметра);	
	
	Для Каждого Группировка1 из ТаблицаДанных Цикл
		
		Если Не ЗначениеЗаполнено(Группировка1[ИмяПараметра]) Тогда
			Продолжить;
		КонецЕсли;	
			
			ИмяШапкиИтог = ИмяШапки + "|СтрокаШапка1";
			ОбластьГруппировка1 = Макет.ПолучитьОбласть(ИмяШапкиИтог);
			ОбластьГруппировка1.Параметры[ИмяПараметра] = Группировка1[ИмяПараметра];
			ДокументРезультат.Вывести(ОбластьГруппировка1);
			
			ТаблицаДанныхГруппировка1 = СоздатьПустуюТаблицу();
			МассивДанныхГруппировка1  = ТаблицаГруппировка1.НайтиСтроки(Новый Структура(ИмяПараметра,Группировка1[ИмяПараметра]));
			
			Для Каждого СтрокаГруппировка1 из МассивДанныхГруппировка1 Цикл
				СтрокаДанныхГруппировка1 = ТаблицаДанныхГруппировка1.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДанныхГруппировка1,СтрокаГруппировка1);
			КонецЦикла;
			
			ТаблицаФактИтого = ТаблицаДанныхГруппировка1.Скопировать();
			ТаблицаФактИтого.Свернуть("Месяц,День","ЧасыИтого,ЧасыФакт");
			
			ИмяШапкиОсновнаяЧасть  = ИмяШапки + "|СтрокаШапка2";
			ИмяШапкиИтог2 = ИмяШапки + "|ОбластьИтог";
			
			Для Каждого Месяц из МассивМесяцев Цикл
				
				ОбластьФактИтог1 = Макет.ПолучитьОбласть(ИмяШапкиОсновнаяЧасть);
				ОбластьФактИтог2 = Макет.ПолучитьОбласть(ИмяШапкиИтог2);
				
				МассивДанных = ТаблицаФактИтого.НайтиСтроки(Новый Структура("Месяц",Месяц));
				ВывестиГруппировкуМесяца(Месяц,МассивДанных,ОбластьФактИтог1,ОбластьФактИтог2,ДокументРезультат,"ЧасыФакт");
				
			КонецЦикла;
			
			Если НЕ СтруктураГруппировки2 = Неопределено Тогда
				
				ИмяПараметра1 = СтруктураГруппировки2.Параметр;
				ИмяШапки2    = СтруктураГруппировки2.ИмяШапки1;
				
				ТаблицаСотрудников = СоздатьПустуюТаблицу(Истина);
				Для Каждого ЗначениеМассива из ТаблицаГруппировка1 Цикл
					Сотрудник = ТаблицаСотрудников.Добавить();
					ЗаполнитьЗначенияСвойств(Сотрудник,ЗначениеМассива);
				КонецЦикла;	
				
				ТаблицаДанных = ТаблицаСотрудников.Скопировать();
				ТаблицаДанных.Свернуть(ИмяПараметра1);
				
				Для Каждого ДанныеПоСотруднику Из ТаблицаДанных Цикл
					
					Если Не ЗначениеЗаполнено(ДанныеПоСотруднику[ИмяПараметра1]) Тогда
						Продолжить;
					КонецЕсли;
					
					Отбор = Новый Структура;
					Отбор.Вставить(ИмяПараметра1 , ДанныеПоСотруднику[ИмяПараметра1]);
					Отбор.Вставить(ИмяПараметра  , Группировка1[ИмяПараметра]);
					МассивДанныхПоСотруднику  = ТаблицаСотрудников.НайтиСтроки(Отбор);
					
					Если МассивДанныхПоСотруднику.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;	
					
					ИмяШапкиИтог = ИмяШапки2 + "|СтрокаШапка1";
					ОбластьГруппировка1 = Макет.ПолучитьОбласть(ИмяШапкиИтог);
					ОбластьГруппировка1.Параметры[ИмяПараметра1] = ДанныеПоСотруднику[ИмяПараметра1];
					ДокументРезультат.Вывести(ОбластьГруппировка1);
					
					ТаблицаСотрудниковПоМесяцам = СоздатьПустуюТаблицу(Истина);
					Для Каждого СотрудникФакт из МассивДанныхПоСотруднику Цикл
						СтрокаДанныхПоСотруднику = ТаблицаСотрудниковПоМесяцам.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДанныхПоСотруднику,СотрудникФакт);
					КонецЦикла;
					
					ТаблицаСотрудниковПоМесяцам.Свернуть("Месяц,День","ЧасыИтого,ЧасыФакт");
					
					ИмяШапкиОсновнаяЧасть  = ИмяШапки2 + "|СтрокаШапка2";
					ИмяШапкиИтог2 = ИмяШапки2 + "|ОбластьИтог";
					
					Для Каждого Месяц из МассивМесяцев Цикл
						
						ОбластьФактИтог1 = Макет.ПолучитьОбласть(ИмяШапкиОсновнаяЧасть);
						ОбластьФактИтог2 = Макет.ПолучитьОбласть(ИмяШапкиИтог2);
						
						МассивДанных = ТаблицаСотрудниковПоМесяцам.НайтиСтроки(Новый Структура("Месяц",Месяц));
						ВывестиГруппировкуМесяца(Месяц,МассивДанных,ОбластьФактИтог1,ОбластьФактИтог2,ДокументРезультат,"ЧасыФакт");
						
					КонецЦикла;

				КонецЦикла;
				
			КонецЕсли;	
			
		КонецЦикла;
КонецПроцедуры	

Функция  ПолучитьСледующуюГруппировку(СтруктураГруппировки)
	Возврат СтруктураГруппировки.Структура[0]
КонецФункции	


















