
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если ЗначениеЗаполнено(Параметры.Задача) Тогда
        БизнесПроцесс = Параметры.Задача.БизнесПроцесс;
        ТочкаМаршрута = Параметры.Задача.ТочкаМаршрута;
    Иначе
    	БизнесПроцесс = Параметры.БизнесПроцесс;
    	ТочкаМаршрута = Параметры.ТочкаМаршрута;
    КонецЕсли;
    
	ВозвратНаДоработку = Параметры.ВозвратНаДоработку;
	
	РеквизитыПроцесса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БизнесПроцесс, "Проверяющий, Исполнитель");

	Проверяющий = РеквизитыПроцесса.Проверяющий;
	Исполнитель = РеквизитыПроцесса.Исполнитель;
	
	Если ТочкаМаршрута = БизнесПроцессы.Поручение.ТочкиМаршрута.Проверить И ВозвратНаДоработку Тогда
		Элементы.Исполнитель.Видимость = Истина;
	КонецЕсли;
    
    Элементы.Проверяющий.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("РезультатВыполнения", РезультатВыполнения);
	Результат.Вставить("Проверяющий", Проверяющий);
	Результат.Вставить("Исполнитель", Исполнитель);
	Результат.Вставить("Задача", Исполнитель);
	Закрыть(Результат);
	
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Отказ = Не ПроверитьЗаполнение();
	
КонецПроцедуры


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ВозвратНаДоработку Тогда 
		ПроверяемыеРеквизиты.Добавить("Исполнитель");
	КонецЕсли;
	
	Если ПроверяющийОбязателен Тогда
		ПроверяемыеРеквизиты.Добавить("Проверяющий");
	КонецЕсли;
	
КонецПроцедуры

