#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет объект в оповещения информационного центра.
//
// Параметры:
//	Объект - Ссылка - ссылка на объект.
//
Процедура ДобавитьОповещение(Знач Объект) Экспорт
    
    УстановитьПривилегированныйРежим(Истина);
    
    НоваяЗапись = РегистрыСведений.ОповещенияИнформационногоЦентра.СоздатьМенеджерЗаписи();
	НоваяЗапись.Объект = Объект;
	НоваяЗапись.Записать();
    
КонецПроцедуры

#КонецОбласти     

#КонецЕсли