
&НаКлиенте
Процедура ОткрытьСообщениеОбмена(Команда)
	Данные = ОткрытьСообщениеОбменаНаСервере();
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(Данные.СообщениеОбмена);
	ТД.Показать(Данные.Узел+"_"+Данные.Дата,);
КонецПроцедуры
&НаСервере
Функция ОткрытьСообщениеОбменаНаСервере()
	Данные = Новый Структура;
	лЗапись = РеквизитФормыВЗначение("Запись");
	СообщениеОбмена = лЗапись.ПакетОбмена.Получить();
	Если СообщениеОбмена = Неопределено Тогда
		СообщениеОбмена = "";
	КонецЕсли;
	Данные.Вставить("СообщениеОбмена",СообщениеОбмена);
	Данные.Вставить("Дата",лЗапись.ДатаНачала);
	Данные.Вставить("Узел",лЗапись.УзелИнформационнойБазы.Наименование);
	ЗначениеВРеквизитФормы(лЗапись, "Запись");
	Возврат Данные;
КонецФункции

&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Текст = ПолучитьТекстКомментария();
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(Текст);
	ТД.Показать("Комментарий");
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстКомментария ()
	    лЗапись = РеквизитФормыВЗначение("Запись");
		Возврат лЗапись.Комментарий;		
КонецФункции

	