#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ПустаяСтрока(АдресЭлектроннойПочты) И СтрЧислоВхождений(АдресЭлектроннойПочты, "@") <> 1 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Некорректный адрес электронной почты.'"),,"Объект.АдресЭлектроннойПочты",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Дата = ТекущаяДатаСеанса();
	
	Автор = Пользователи.АвторизованныйПользователь();
	ВидПриглашения = Перечисления.ВидыПриглашений.Менеджеру;
	
	СведенияОПользователе = РегистрыСведений.СведенияОПользователях.СведенияОПользователе(Автор);
	
	ОбслуживающаяОрганизация = СведенияОПользователе.ОбслуживающаяОрганизация;
	ЛинияПоддержки = СведенияОПользователе.ЛинияПоддержки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
        |   ПриглашениеДляРегистрации.ВидПриглашения
        |ИЗ
        |   Документ.ПриглашениеДляРегистрации КАК ПриглашениеДляРегистрации
        |ГДЕ
        |   НЕ ПриглашениеДляРегистрации.ПометкаУдаления
        |
        |УПОРЯДОЧИТЬ ПО
        |   ПриглашениеДляРегистрации.Дата УБЫВ";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
	КонецЕсли; 
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
        |   Приглашение.Сервис
        |ИЗ
        |   Документ.ПриглашениеДляРегистрации КАК Приглашение
        |ГДЕ
        |   НЕ Приглашение.ПометкаУдаления
        |
        |УПОРЯДОЧИТЬ ПО
        |   Приглашение.Дата УБЫВ";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "Сервис");
	КонецЕсли; 
		
	Сервис = Справочники.Сервисы.СервисПоУмолчанию(Сервис);
    
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПолноеИмяПользователя = "";
	АдресЭлектроннойПочты = "";
	Пользователь = Справочники.Пользователи.ПустаяСсылка();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
