
Функция ТекущиеДанныеПоСотруднику(Сотрудник, ДатаСреза) Экспорт
	
	СтруктураВозврата = Новый Структура("ТекущаяДолжность", "ТекущееПодразделение");	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадроваяИсторияСрезПоследних.Подразделение КАК ТекущееПодразделение,
		|	КадроваяИсторияСрезПоследних.Должность КАК ТекущаяДолжность
		|ИЗ
		|	РегистрСведений.КадроваяИстория.СрезПоследних(&ДатаСреза, Сотрудник = &Сотрудник) КАК КадроваяИсторияСрезПоследних
		|ГДЕ
		|	КадроваяИсторияСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСотрудника.Работает)";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадроваяИсторияСрезПоследних.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(КадроваяИсторияСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ вт_МаксПоКадровымДанным
	|ИЗ
	|	РегистрСведений.КадроваяИстория.СрезПоследних(&ДатаДок, Сотрудник = &Сотрудник) КАК КадроваяИсторияСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	КадроваяИсторияСрезПоследних.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_МаксПоКадровымДанным.Сотрудник КАК Сотрудник,
	|	КадроваяИстория.Подразделение КАК ПодразделениеСотрудника
	|ПОМЕСТИТЬ вт_КадровыеДанные
	|ИЗ
	|	вт_МаксПоКадровымДанным КАК вт_МаксПоКадровымДанным
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИстория КАК КадроваяИстория
	|		ПО вт_МаксПоКадровымДанным.Сотрудник = КадроваяИстория.Сотрудник
	|			И вт_МаксПоКадровымДанным.Период = КадроваяИстория.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ВнеплановыеОтсутствия"" КАК ИмяРегистра_,
	|	&Сотрудник КАК Сотрудник,
	|	вт_КадровыеДанные.ПодразделениеСотрудника КАК Подразделение,
	|	РегистрацияВнеплановыхОтсутствийОтсутствия.Ссылка.Дата КАК Период,
	|	РегистрацияВнеплановыхОтсутствийОтсутствия.ДатаНачалаОтсутствия,
	|	РегистрацияВнеплановыхОтсутствийОтсутствия.ДатаОкончанияОтсутствия,
	|	РегистрацияВнеплановыхОтсутствийОтсутствия.КоличествоЧасов,
	|	РегистрацияВнеплановыхОтсутствийОтсутствия.ТипОтсутствия,
	|	РегистрацияВнеплановыхОтсутствийОтсутствия.ПричинаОтсутствия
	|ИЗ
	|	Документ.РегистрацияВнеплановыхОтсутствий.Отсутствия КАК РегистрацияВнеплановыхОтсутствийОтсутствия
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_КадровыеДанные КАК вт_КадровыеДанные
	|		ПО РегистрацияВнеплановыхОтсутствийОтсутствия.Ссылка.Сотрудник = вт_КадровыеДанные.Сотрудник
	|ГДЕ
	|	РегистрацияВнеплановыхОтсутствийОтсутствия.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("ссылка"    , ДокументСсылка);
	Запрос.УстановитьПараметр("Сотрудник" , ДокументСсылка.Сотрудник);
	Запрос.УстановитьПараметр("ДатаДок"   , ДокументСсылка.Дата);
	
    ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
    ТаблицыДляДвижений.Вставить("ТаблицаВнеплановыеОтсутствия"			, Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		
		Объект = Документы.РегистрацияВнеплановыхОтсутствий.СоздатьДокумент();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		
		Объект = Документы.РегистрацияВнеплановыхОтсутствий.СоздатьДокумент();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		
		Объект = Документы.РегистрацияВнеплановыхОтсутствий.СоздатьДокумент();
		
	КонецЕсли;
	
КонецПроцедуры
