
&НаКлиенте
Процедура Установить(Команда)
	Если Коэффициент < 1 И Не ЗначениеЗаполнено(ВидДействияСНепринятымиЧасами) Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено поле ""Непринятые часы"" " +
						"Коэффициент: " + Коэффициент + Символы.ПС + Символы.ПС;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Коэффициент"					, Коэффициент);
	СтруктураСтроки.Вставить("ВидДействияСНепринятымиЧасами", ВидДействияСНепринятымиЧасами);
	СтруктураСтроки.Вставить("ПричинаНепринятия"			, ПричинаНепринятия);
	СтруктураСтроки.Вставить("ОписаниеПричины"				, ОписаниеПричины);
	
	Закрыть(СтруктураСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Коэффициент = 1;
	Элементы.ВидДействияСНепринятымиЧасами.Доступность = Ложь;
	Элементы.ПричинаНепринятия.Доступность = Ложь;
	Элементы.ОписаниеПричины.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентПриИзменении(Элемент)
	Если Коэффициент < 1 Тогда
		Элементы.ВидДействияСНепринятымиЧасами.Доступность = Истина;
		Элементы.ПричинаНепринятия.Доступность = Истина;
		Элементы.ОписаниеПричины.Доступность = Истина;
	Иначе
		Элементы.ВидДействияСНепринятымиЧасами.Доступность = Ложь;
		Элементы.ПричинаНепринятия.Доступность = Ложь;
		Элементы.ОписаниеПричины.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры
