
&НаКлиенте
Процедура ОК(Команда)
	СтруктураЗакрытия = Новый Структура;
	СтруктураЗакрытия.Вставить("Акт", Акт);
	СтруктураЗакрытия.Вставить("ВСчетБудущегоАкта", ВСчетБудущегоАкта);
	СтруктураЗакрытия.Вставить("КомментарийДляБудущегоАкта", КомментарийДляБудущегоАкта);
	
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры


&НаКлиенте
Процедура АктПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Акт) Тогда
		ВСчетБудущегоАкта = Ложь;
		КомментарийДляБудущегоАкта = "";
		Элементы.ВСчетБудущегоАкта.Доступность = Ложь;
		Элементы.КомментарийДляБудущегоАкта.Доступность = Ложь;
	Иначе
		Элементы.ВСчетБудущегоАкта.Доступность = Истина;
		Элементы.КомментарийДляБудущегоАкта.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры

