Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФактическиеПоказателиПроектаПоказатели.Сотрудник КАК Сотрудник,
	|	ФактическиеПоказателиПроектаПоказатели.КонтрагентАбонент КАК КонтрагентАбонент,
	|	ФактическиеПоказателиПроектаПоказатели.Время КАК Время,
	|	ФактическиеПоказателиПроектаПоказатели.Сумма КАК Сумма,
	|	ФактическиеПоказателиПроектаПоказатели.НомерСтроки КАК НомерСтроки,
	|	""ПланированиеПроектов_Факт"" КАК ИмяРегистра_,
	|	&ПериодПланирования КАК ПериодПланирования,
	|	&Период КАК Период,
	|	&Ссылка КАК Регистратор,
	|	&Проект КАК Проект,
	|	ФактическиеПоказателиПроектаПоказатели.Статья КАК Статья,
	|	ФактическиеПоказателиПроектаПоказатели.Ссылка.ЭтапПроекта КАК ЭтапПроекта
	|ИЗ
	|	Документ.ФактическиеПоказателиПроекта.Показатели КАК ФактическиеПоказателиПроектаПоказатели
	|ГДЕ
	|	ФактическиеПоказателиПроектаПоказатели.Ссылка = &Ссылка";
Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
Запрос.УстановитьПараметр("Период",ДокументСсылка.Дата);
Запрос.УстановитьПараметр("ПериодПланирования",ДокументСсылка.Период);
Запрос.УстановитьПараметр("Проект",ДокументСсылка.Проект);

Результаты = Запрос.Выполнить();

ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
ТаблицыДляДвижений.Вставить("ТаблицаПланированиеПроектов_Факт"			, Результаты.Выгрузить());
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ФактическиеПоказателиПроекта.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ФактическиеПоказателиПроекта.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ФактическиеПоказателиПроекта.СоздатьДокумент();
	КонецЕсли;
КонецПроцедуры
