
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.РежимВыбора Тогда	
		Элементы.Список.РежимВыбора                    =    Истина;		
        Заголовок                                      = НСтр("ru = 'Выбор проекта'");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьURMExchange(Команда)
	Если URMExchangeСервер.ПолучитьКонстантуОбменСОБД()Тогда
		ИмяОперации = "GetPartner";
		Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ОткрытьФорму("Обработка.СозданиеОбъектовURMExchange.Форма.Форма",Новый Структура("ИмяОперации", ИмяОперации),,,,,,Режим);
	Иначе
		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта",,,,,,Новый ОписаниеОповещения("СоздатьЭлементЗавершение", ЭтаФорма));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлементЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ЭтаФорма.ОбновитьОтображениеДанных();	
КонецПроцедуры
