
#Область ОбработчикиСобытийФормы
    
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсходнаяСсылка = Объект.Ссылка;
	ВерсииКонфигурации.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	Если Не ЗначениеЗаполнено(ИсходнаяСсылка) Тогда
		Элементы.ВерсииКонфигурации.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ИсходнаяСсылка <> Объект.Ссылка Тогда
		ИсходнаяСсылка = Объект.Ссылка;
		Элементы.ВерсииКонфигурации.Доступность = Истина;
		ВерсииКонфигурации.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыВерсии
    
&НаКлиенте
Процедура ВерсииКонфигурацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ПараметрыФормы = Новый Структура("Владелец", Объект.Ссылка);
	ОткрытьФорму("Справочник.ВерсииКонфигураций.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 
