
#Область ПрограммныйИнтерфейс

// Возвращает настроенные шаблоны по предмету.
//
// Параметры:
//  Предмет - ЛюбаяСсылка -  предмет для определения списка шаблонов.
// 
// Возвращаемое значение:
//  Массив - шаблоны по предмету.
//
Функция ШаблоныПоПредмету(Предмет) Экспорт
	
	Возврат ШаблоныБизнесПроцессов.ШаблоныПоОбъекту(Предмет, Истина);
	
КонецФункции 

// Получает имя формы бизнес-процесса по шаблону бизнес-процесса.
//
Функция ПолучитьИмяФормыПроцессаПоШаблону(Шаблон) Экспорт
	
	ИмяПроцесса = Справочники[Шаблон.Метаданные().Имя].ИмяПроцесса(Шаблон);
	Возврат Метаданные.БизнесПроцессы[ИмяПроцесса].ОсновнаяФормаОбъекта.ПолноеИмя();
	
КонецФункции

#КонецОбласти 