
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("РуководительПроектов") и не РольДоступна("ПолныеПрава") тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Проект", ОбщегоНазначения.ПолучитьСписокДоступныхПроектов(), ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	Если Параметры.РежимВыбора Тогда	
		Элементы.Список.РежимВыбора                    =    Истина;		
        Заголовок                                      = НСтр("ru = 'Выбор документа'");
	КонецЕсли;
КонецПроцедуры
