Процедура СоздатьКонтрагентов() Экспорт

	Для Каждого СтрокаРезультат из ТаблицаКонтрагентов Цикл
		ЭлементСпр = Справочники.Абоненты.НайтиПоРеквизиту("ИНН",СтрокаРезультат.ИНН);
		Если ЗначениеЗаполнено(ЭлементСпр) Тогда
			Продолжить;
		КонецЕсли;	
		ОбъектСпр = Справочники.Абоненты.СоздатьЭлемент();
		ОбъектСпр.ИНН = СтрокаРезультат.ИНН;
		ОбъектСпр.Наименование = СтрокаРезультат.Контрагент;
		Попытка 
			ОбъектСпр.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;	
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Загрузка завершена";
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
КонецПроцедуры	