&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	УстановитьКлючВарианта();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьКлючВарианта();
	
	Если Параметры.Свойство("Пользователь") Тогда
		ЭтотОбъект.Сотрудник = Параметры.Пользователь.Сотрудник;			
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	УстановитьКлючВарианта(); 
КонецПроцедуры

&НаСервере
Процедура УстановитьКлючВарианта()
	Отчет.КлючВарианта = КлючТекущегоВарианта;
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ЭтотОбъект.Сотрудник) Тогда
		ЗаполнитьОтборПоСотрудникуНаСервере();	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтборПоСотрудникуНаСервере()
	Для Каждого ЭлементОтбора из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник") Тогда
				ЭлементОтбора.ПравоеЗначение = ЭтотОбъект.Сотрудник;
				ЭлементОтбора.Использование  = Истина;
								
				ПользовательскийОтбор = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
				Если НЕ ПользовательскийОтбор = Неопределено Тогда
					ПользовательскийОтбор.Использование  = Истина;
					ПользовательскийОтбор.ПравоеЗначение = Сотрудник;
					ПользовательскийОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Сотрудник");
					ПользовательскийОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				КонецЕсли;
				
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
КонецПроцедуры	




