
#Область ПрограммныйИнтерфейс
    
// Добавляет в отчет за дату
//
Процедура ДобавитьВОтчет(ПараметрыОтчета, ПараметрыОповещения) Экспорт
	
	ПараметрыОповещения = Новый Структура;
    
    Если ПараметрыОповещения.Свойство("Пользователь") Тогда
        Пользователь = ПараметрыОповещения.Пользователь;
    Иначе
	    Пользователь = Пользователи.АвторизованныйПользователь();
        ПараметрыОтчета.Вставить("Пользователь", Пользователь);
    КонецЕсли;
	
	Сведения = РегистрыСведений.СведенияОПользователях.СведенияОПользователе(Пользователь);
	
    ПараметрыОтчета.Вставить("ЛинияПоддержки", Сведения.ЛинияПоддержки);
    ПараметрыОтчета.Вставить("ОбслуживающаяОрганизация", Сведения.ОбслуживающаяОрганизация);
        
    // запись в регистр ФактическиеТрудозатраты
	МенеджерЗаписи = РегистрыСведений.ФактическиеТрудозатраты.СоздатьМенеджерЗаписи();
	//{Рарус kruser 2018.12.21 78092
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыОтчета, 
        "Источник, ДатаРаботы, ОписаниеРаботы, Длительность, ОбслуживающаяОрганизация, ЛинияПоддержки, Пользователь, ВремяНачала, ВремяОкончания, Работа");	
	//ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыОтчета, 
	//    "Источник, ДатаРаботы, ОписаниеРаботы, Длительность, ОбслуживающаяОрганизация, ЛинияПоддержки, Пользователь");
	//}Рарус kruser 2018.12.21 78092
    
	МенеджерЗаписи.НомерДобавления = МаксимальныйНомерДобавления(
		МенеджерЗаписи.ОбслуживающаяОрганизация, 
		МенеджерЗаписи.ЛинияПоддержки, 
		МенеджерЗаписи.Пользователь, 
		МенеджерЗаписи.ДатаРаботы);
		
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Возвращает номер добавления записи о трудозатратах по текущему пользователю
//
Функция МаксимальныйНомерДобавления(ОбслуживающаяОрганизация, ЛинияПоддержки, Пользователь, ДатаРаботы) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ФактическиеТрудозатраты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбслуживающаяОрганизация.Установить(ОбслуживающаяОрганизация);
	НаборЗаписей.Отбор.ЛинияПоддержки.Установить(ЛинияПоддержки);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.ДатаРаботы.Установить(ДатаРаботы);
	НаборЗаписей.Прочитать();
	
	МаксНомерДобавления = 0;
	Если НаборЗаписей.Количество() > 0 Тогда 
		ТаблицаНабора = НаборЗаписей.Выгрузить();
		ТаблицаНабора.Сортировать("НомерДобавления Убыв");
		МаксНомерДобавления = ТаблицаНабора[0].НомерДобавления + 1;
	КонецЕсли;	
	
	Возврат МаксНомерДобавления;
	
КонецФункции	

#КонецОбласти
